import config
from qtpy.QtWidgets import QWidget


class BibleReadingPlan(QWidget):

    template = {
        # Source / credits of the following plan: https://www.biblica.com/resources/reading-plans/
        1: [False, '创世记 1, 创世记 2:1-17, 马太福音 1:1-25, 诗篇 1:1-6'],
        2: [False,
            '创世记 2:18-25, 创世记 3, 创世记 4:1-16, 马太福音 2:1-18, 诗篇 '
            '2:1-12'],
        3: [False,
            '创世记 4:17-26, 创世记 5, 创世记 6, 马太福音 2:19-23, 马太福音 3, 诗篇 '
            '3:1-8'],
        4: [False,
            '创世记 7, 创世记 8, 创世记 9:1-17, 马太福音 4:1-22, 箴言 1:1-7'],
        5: [False,
            '创世记 9:18-29, 创世记 10, 创世记 11:1-9, 马太福音 4:23-25, 马太福音 '
            '5:1-20, 诗篇 4:1-8'],
        6: [False,
            '创世记 11:10-32, 创世记 12, 创世记 13, 马太福音 5:21-42, 诗篇 5:1-12'],
        7: [False,
            '创世记 14, 创世记 15, 创世记 16, 马太福音 5:43-48, 马太福音 6:1-24, '
            '诗篇 6'],
        8: [False,
            '创世记 17, 创世记 18, 马太福音 6:25-34, 马太福音 7:1-23, 箴言 '
            '1:8-19'],
        9: [False,
            '创世记 19, 创世记 20:1-18, 马太福音 7:24-29, 马太福音 8:1-22, 诗篇 '
            '7:1-9'],
        10: [False,
             '创世记 21, 创世记 22, 创世记 23, 马太福音 8:23-34, 马太福音 9:1-13, '
             '诗篇 7:10-17'],
        11: [False, '创世记 24:1-67, 马太福音 9:14-38, 诗篇 8:1-9'],
        12: [False, '创世记 25, 创世记 26, 马太福音 10:1-31, 箴言 1:20-33'],
        13: [False,
             '创世记 27, 创世记 28:1-22, 马太福音 10:32-42, 马太福音 11:1-15, 诗篇 '
             '9:1-6'],
        14: [False, '创世记 29, 创世记 30, 马太福音 11:16-30, 诗篇 9:7-12'],
        15: [False, '创世记 31:1-55, 马太福音 12:1-21, 诗篇 9:13-20'],
        16: [False, '创世记 32, 创世记 33, 马太福音 12:22-45, 箴言 2:1-11'],
        17: [False,
             '创世记 34, 创世记 35, 马太福音 12:46-50, 马太福音 13:1-17, 诗篇 '
             '10:1-11'],
        18: [False, '创世记 36, 创世记 37, 马太福音 13:18-35, 诗篇 10:12-18'],
        19: [False, '创世记 38, 创世记 39, 马太福音 13:36-58, 诗篇 11:1-7'],
        20: [False, '创世记 40, 创世记 41:1-40, 马太福音 14:1-21, 箴言 2:12-22'],
        21: [False,
             '创世记 41:41-57, 创世记 42, 马太福音 14:22-36, 马太福音 15:1-9, 诗篇 '
             '12:1-8'],
        22: [False, '创世记 43, 创世记 44, 马太福音 15:10-39, 诗篇 13:1-6'],
        23: [False,
             '创世记 45, 创世记 46, 创世记 47:1-12, 马太福音 16:1-20, 诗篇 14:1-7'],
        24: [False,
             '创世记 47:13-31, 创世记 48, 马太福音 16:21-28, 马太福音 17:1-13, '
             '箴言 3:1-10'],
        25: [False,
             '创世记 49, 创世记 50, 马太福音 17:14-27, 马太福音 18:1-9, 诗篇 15:1-5'],
        26: [False, '约伯记 1, 约伯记 2, 约伯记 3, 马太福音 18:10-35, 诗篇 16:1-11'],
        27: [False, '约伯记 4, 约伯记 5, 约伯记 6, 约伯记 7, 马太福音 19:1-15, 诗篇 17:1-5'],
        28: [False, '约伯记 8, 约伯记 9, 约伯记 10, 马太福音 19:16-30, 箴言 3:11-20'],
        29: [False, '约伯记 11, 约伯记 12, 约伯记 13, 约伯记 14, 马太福音 20:1-19, 诗篇 17:6-12'],
        30: [False,
             '约伯记 15, 约伯记 16, 约伯记 17, 约伯记 18, 马太福音 20:20-34, 诗篇 17:13-15'],
        31: [False, '约伯记 19, 约伯记 20, 约伯记 21, 马太福音 21:1-17, 诗篇 18:1-6'],
        32: [False, '约伯记 22, 约伯记 23, 约伯记 24, 马太福音 21:18-32, 箴言 3:21-35'],
        33: [False,
             '约伯记 25, 约伯记 26, 约伯记 27, 约伯记 28, 约伯记 29, 马太福音 21:33-46, 马太福音 '
             '22:1-14, 诗篇 18:7-15'],
        34: [False, '约伯记 30, 约伯记 31, 约伯记 32, 马太福音 22:15-46, 诗篇 18:16-24'],
        35: [False, '约伯记 33, 约伯记 34, 马太福音 23:1-39, 诗篇 18:25-36'],
        36: [False, '约伯记 35, 约伯记 36, 约伯记 37, 马太福音 24:1-31, 箴言 4:1-9'],
        37: [False,
             '约伯记 38, 约伯记 39, 约伯记 40:1-2, 马太福音 24:32-51, 马太福音 25:1-13, 诗篇 '
             '18:37-42'],
        38: [False, '约伯记 40:3-24, 约伯记 41, 约伯记 42, 马太福音 25:14-46, 诗篇 18:43-50'],
        39: [False, '出埃及记 1, 出埃及记 2, 出埃及记 3, 马太福音 26:1-30, 诗篇 19:1-6'],
        40: [False,
             '出埃及记 4, 出埃及记 5, 出埃及记 6:1-12, 马太福音 26:31-46, 箴言 4:10-19'],
        41: [False,
             '出埃及记 6:13-30, 出埃及记 7,出埃及记 8, 马太福音 26:47-68, 诗篇 19:7-14'],
        42: [False,
             '出埃及记 9, 出埃及记 10, 马太福音 26:69-75, 马太福音 27:1-10, 诗篇 20:1-9'],
        43: [False, '出埃及记 11, 出埃及记 12, 马太福音 27:11-44, 诗篇 21:1-7'],
        44: [False, '出埃及记 13, 出埃及记 14, 马太福音 27:45-66, 箴言 4:20-27'],
        45: [False, '出埃及记 15, 出埃及记 16, 马太福音 28:1-20, 诗篇 21:8-13'],
        46: [False, '出埃及记 17, 出埃及记 18, 马可福音 1:1-28, 诗篇 22:1-11'],
        47: [False, '出埃及记 19, 出埃及记 20, 马可福音 1:29-45, 马可福音 2:1-17, 诗篇 22:12-21'],
        48: [False,
             '出埃及记 21, 出埃及记 22, 马可福音 2:18-27, 马可福音 3:1-30, 箴言 5:1-14'],
        49: [False, '出埃及记 23, 出埃及记 24, 马可福音 3:31-35, 马可福音 4:1-29, 诗篇 22:22-31'],
        50: [False, '出埃及记 25, 出埃及记 26, 马可福音 4:30-41, 马可福音 5:1-20, 诗篇 23:1-6'],
        51: [False, '出埃及记 27, 出埃及记 28, 马可福音 5:21-43, 马可福音 6:1-6, 诗篇 24:1-10'],
        52: [False, '出埃及记 29, 出埃及记 30, 马可福音 6:7-29, 箴言 5:15-23'],
        53: [False, '出埃及记 31, 出埃及记 32, 出埃及记 33:1-6, 马可福音 6:30-56, 诗篇 25:1-7'],
        54: [False, '出埃及记 33:7-23, 出埃及记 34, 马可福音 7:1-30, 诗篇 25:8-15'],
        55: [False, '出埃及记 35, 出埃及记 36, 马可福音 7:31-37, 马可福音 8:1-13, 诗篇 25:16-22'],
        56: [False, '出埃及记 37, 出埃及记 38, 马可福音 8:14-38, 马可福音 9:1, 箴言 6:1-11'],
        57: [False, '出埃及记 39, 出埃及记 40, 马可福音 9:2-32, 诗篇 26:1-12'],
        58: [False,
             '利未记 1, 利未记 2, 利未记 3, 马可福音 9:33-50, 马可福音 10:1-12, '
             '诗篇 27:1-6'],
        59: [False, '利未记 4, 利未记 5:1-13, 马可福音 10:13-31, 诗篇 27:7-14'],
        60: [False,
             '利未记 5:14-19, 利未记 6, 利未记 7:1-10, 马可福音 10:32-52, '
             '箴言 6:12-19'],
        61: [False, '利未记 7:11-38, 利未记 8, 马可福音 11:1-27, 诗篇 28'],
        62: [False,
             '利未记 9, 利未记 10, 马可福音 11:28-33, 马可福音 12:1-12, 诗篇 29'],
        63: [False, '利未记 11, 利未记 12, 马可福音 12:13-27, 诗篇 30:1-7'],
        64: [False, '利未记 13:1-59, 马可福音 12:28-44, 箴言 6:20-29'],
        65: [False, '利未记 14:1-57, 马可福音 13:1-31, 诗篇 30:8-12'],
        66: [False,
             '利未记 15, 利未记 16, 马可福音 13:32-37, 马可福音 14:1-16, 诗篇 31:1-8'],
        67: [False, '利未记 17, 利未记 18, 马可福音 14:17-42, 诗篇 31:9-18'],
        68: [False, '利未记 19, 利未记 20, 马可福音 14:43-72, 箴言 6:30-35'],
        69: [False, '利未记 21, 利未记 22, 马可福音 15:1-32, 诗篇 31:19-24'],
        70: [False, '利未记 23, 利未记 24, 马可福音 15:33-47, 诗篇 32'],
        71: [False, '利未记 25, 利未记 26:1-13, 马可福音 16:1-20, 诗篇 33:1-11'],
        72: [False, '利未记 26:14-46, 利未记 27, 路加福音 1:1-25, 箴言 7:1-5'],
        73: [False, '民数记 1, 民数记 2:1-9, 路加福音 1:26-38, 诗篇 33:12-22'],
        74: [False, '民数记 2:10-34, 民数记 3, 路加福音 1:39-56, 诗篇 34:1-10'],
        75: [False, '民数记 4, 民数记 5:1-10, 路加福音 1:57-80, 诗篇 34:11-22'],
        76: [False, '民数记 5:11-31, 民数记 6:1-27, 路加福音 2:1-20, 箴言 7:6-20'],
        77: [False, '民数记 7:1-65, 路加福音 2:21-40, 诗篇 35:1-10'],
        78: [False,
             '民数记 7:66-89, 民数记 8, 民数记 9:1-14, 路加福音 2:41-52, 诗篇 '
             '35:11-18'],
        79: [False,
             '民数记 9:15-23, 民数记 10, 民数记 11:1-3, 路加福音 3:1-22, 诗篇 '
             '35:19-28'],
        80: [False,
             '民数记 11:4-35, 民数记 12, 民数记 13:1-25, 路加福音 3:23-38, 路加福音 '
             '4:1-13, 箴言 7:21-27'],
        81: [False, '民数记 13:26-33, 民数记 14, 路加福音 4:14-37, 诗篇 36:1-12'],
        82: [False,
             '民数记 15, 民数记 16:1-35, 路加福音 4:38-44, 路加福音 5:1-16, 诗篇 37:1-9'],
        83: [False,
             '民数记 16:36-50, 民数记 17, 民数记 18, 路加福音 5:17-32, 诗篇 37:10-20'],
        84: [False,
             '民数记 19, 民数记 20, 民数记 21:1-3, 路加福音 5:33-39, 路加福音 6:1-11, '
             '箴言 8:1-11'],
        85: [False, '民数记 21:4-35, 民数记 22:1-20, 路加福音 6:12-36, 诗篇 37:21-31'],
        86: [False,
             '民数记 22:21-41, 民数记 23:1-26, 路加福音 6:37-49, 路加福音 7:1-10, 诗篇 '
             '37:32-40'],
        87: [False,
             '民数记 23:27-30, 民数记 24, 民数记 25, 路加福音 7:11-35, 诗篇 38:1-11'],
        88: [False, '民数记 26, 民数记 27:1-11, 路加福音 7:36-50, 箴言 8:12-21'],
        89: [False,
             '民数记 27:12-23, 民数记 28, 民数记 29:1-11, 路加福音 8:1-18, 诗篇 '
             '38:12-22'],
        90: [False,
             '民数记 29:12-40, 民数记 30, 民数记 31:1-24, 路加福音 8:19-39, 诗篇 '
             '39:1-13'],
        91: [False,
             '民数记 31:25-54, 民数记 32, 路加福音 8:40-56, 路加福音 9:1-9, 诗篇 40:1-8'],
        92: [False, '民数记 33, 民数记 34, 路加福音 9:10-27, 箴言 8:22-31'],
        93: [False, '民数记 35, 民数记 36:1-12, 路加福音 9:28-56, 诗篇 40:9-17'],
        94: [False,
             '申命记 1, 申命记 2:1-23, 路加福音 9:57-62, 路加福音 10:1-24, 诗篇 '
             '41:1-6'],
        95: [False,
             '申命记 2:24-37, 申命记 3, 申命记 4:1-14, 路加福音 10:25-42, '
             '路加福音 11:1-4, 诗篇 41:7-13'],
        96: [False,
             '申命记 4:15-49, 申命记 5, 路加福音 11:5-32, 箴言 8:32-36'],
        97: [False,
             '申命记 6, 申命记 7, 申命记 8, 路加福音 11:33-54, 诗篇 '
             '42:1-6'],
        98: [False, '申命记 9, 申命记 10, 路加福音 12:1-34, 诗篇 42:7-11'],
        99: [False, '申命记 11, 申命记 12, 路加福音 12:35-59, 诗篇 43:1-5'],
        100: [False, '申命记 13, 申命记 14, 路加福音 13:1-30, 箴言 9:1-12'],
        101: [False,
              '申命记 15, 申命记 16:1-20, 路加福音 13:31-35, 路加福音 14:1-14, '
              '诗篇 44:1-12'],
        102: [False,
              '申命记 16:21-22, 申命记 17, 申命记 18, 路加福音 14:15-35, '
              '诗篇 44:13-26'],
        103: [False, '申命记 19, 申命记 20, 路加福音 15:1-32, 诗篇 45:1-9'],
        104: [False, '申命记 21, 申命记 22, 路加福音 16:1-18, 箴言 9:13-18'],
        105: [False,
              '申命记 23, 申命记 24, 申命记 25:1-19, 路加福音 16:19-31, '
              '路加福音 17:1-10, 诗篇 45:10-17'],
        106: [False,
              '申命记 26, 申命记 27, 申命记 28:1-14, 路加福音 17:11-37, '
              '诗篇 46:1-11'],
        107: [False, '申命记 28:15-68, 路加福音 18:1-30, 诗篇 47:1-9'],
        108: [False,
              '申命记 29, 申命记 30:1-10, 路加福音 18:31-43, 路加福音 19:1-10, '
              '箴言 10:1-10'],
        109: [False,
              '申命记 30:11-20, 申命记 31:1-29, 路加福音 19:11-44, 诗篇 '
              '48:1-8'],
        110: [False,
              '申命记 31:30, 申命记 32, 路加福音 19:45-48, 路加福音 20:1-26, 诗篇 '
              '48:9-14'],
        111: [False,
              '申命记 33, 申命记 34:1-12, 路加福音 20:27-47, 路加福音 21:1-4, 诗篇 '
              '49:1-20'],
        112: [False, '约书亚记 1, 约书亚记 2, 路加福音 21:5-38, 箴言 10:11-20'],
        113: [False, '约书亚记 3, 约书亚记 4, 约书亚记 5:1-12, 路加福音 22:1-38, 诗篇 50:1-15'],
        114: [False,
              '约书亚记 5:13-15, 约书亚记 6, 约书亚记 7, 路加福音 22:39-62, 诗篇 50:16-23'],
        115: [False,
              '约书亚记 8, 约书亚记 9:1-15, 路加福音 22:63-71, 路加福音 23:1-25, 诗篇 51:1-9'],
        116: [False, '约书亚记 9:16-27, 约书亚记 10, 路加福音 23:26-56, 箴言 10:21-30'],
        117: [False, '约书亚记 11, 约书亚记 12, 路加福音 24:1-35, 诗篇 51:10-19'],
        118: [False, '约书亚记 13, 约书亚记 14, 路加福音 24:36-53, 诗篇 52:1-9'],
        119: [False, '约书亚记 15, 约书亚记 16, 约翰福音 1:1-28, 诗篇 53:1-6'],
        120: [False,
              '约书亚记 17, 约书亚记 18, 约翰福音 1:29-51, 箴言 10:31-32, 箴言 '
              '11:1-8'],
        121: [False,
              '约书亚记 19, 约书亚记 20, 约书亚记 21:1-19, 约翰福音 2:1-25, 诗篇 54:1-7'],
        122: [False, '约书亚记 21:20-45, 约书亚记 22, 约翰福音 3:1-21, 诗篇 55:1-11'],
        123: [False, '约书亚记 23, 约书亚记 24, 约翰福音 3:22-36, 诗篇 55:12-23'],
        124: [False, '士师记 1, 士师记 2:1-5, 约翰福音 4:1-26, 箴言 11:9-18'],
        125: [False, '士师记 2:6-23, 士师记 3, 约翰福音 4:27-42, 诗篇 56:1-13'],
        126: [False, '士师记 4, 士师记 5, 约翰福音 4:43-54, 约翰福音 5:1-15, 诗篇 57:1-6'],
        127: [False, '士师记 6, 士师记 7:1-8, 约翰福音 5:16-30, 诗篇 57:7-11'],
        128: [False, '士师记 7:8-25, 士师记 8, 约翰福音 5:31-47, 箴言 11:19-28'],
        129: [False, '士师记 9, 约翰福音 6:1-24, 诗篇 58:1-11'],
        130: [False, '士师记 10, 士师记 11, 约翰福音 6:25-59, 诗篇 59:1-8'],
        131: [False, '士师记 12, 士师记 13, 约翰福音 6:60-71, 约翰福音 7:1-13, 诗篇 59:9-19'],
        132: [False,
              '士师记 14, 士师记 15, 约翰福音 7:14-44, 箴言 11:29-31, 箴言 '
              '12:1-7'],
        133: [False, '士师记 16, 士师记 17, 约翰福音 7:45-53, 约翰福音 8:1-11, 诗篇 60:1-4'],
        134: [False, '士师记 18, 士师记 19, 约翰福音 8:12-30, 诗篇 60:5-12'],
        135: [False, '士师记 20, 士师记 21, 约翰福音 8:31-59, 诗篇 61:1-8'],
        136: [False, '路得记 1, 路得记 2, 约翰福音 9:1-34, 箴言 12:8-17'],
        137: [False, '路得记 3, 路得记 4, 约翰福音 9:35-41, 约翰福音 10:1-21, 诗篇 62:1-12'],
        138: [False, '撒母耳记上 1, 撒母耳记上 2:1-26, 约翰福音 10:22-42, 诗篇 63:1-11'],
        139: [False,
              '撒母耳记上 2:27-36, 撒母耳记上 3, 撒母耳记上 4, 约翰福音 11:1-44, 诗篇 64:1-10'],
        140: [False,
              '撒母耳记上 5, 撒母耳记上 6, 撒母耳记上 7, 约翰福音 11:45-57, 约翰福音 12:1-11, '
              '箴言 12:18-27'],
        141: [False,
              '撒母耳记上 8, 撒母耳记上 9, 撒母耳记上 10:1-8, 约翰福音 12:12-26, 诗篇 65:1-13'],
        142: [False,
              '撒母耳记上 10:9-27, 撒母耳记上 11, 撒母耳记上 12, 约翰福音 12:37-50, 约翰福音 '
              '13:1-17, 诗篇 66:1-12'],
        143: [False, '撒母耳记上 13, 撒母耳记上 14:1-23, 约翰福音 13:18-38, 诗篇 66:13-20'],
        144: [False,
              '撒母耳记上 14:24-52, 撒母耳记上 15, 约翰福音 14:1-31, 箴言 12:28, 箴言 '
              '13:1-9'],
        145: [False,
              '撒母耳记上 16, 撒母耳记上 17:1-37, 约翰福音 15, 约翰福音 16:1-4, 诗篇 67:1-7'],
        146: [False,
              '撒母耳记上 17:38-58, 撒母耳记上 18, 约翰福音 16:5-33, 约翰福音 17:1-5, 诗篇 '
              '68:1-6'],
        147: [False, '撒母耳记上 19, 撒母耳记上 20, 约翰福音 17:6-26, 诗篇 68:7-14'],
        148: [False,
              '撒母耳记上 21, 撒母耳记上 22, 撒母耳记上 23, 约翰福音 18:1-24, 箴言 '
              '13:10-19'],
        149: [False, '撒母耳记上 24, 撒母耳记上 25, 约翰福音 18:25-40, 诗篇 68:15-20'],
        150: [False,
              '撒母耳记上 26, 撒母耳记上 27, 撒母耳记上 28, 约翰福音 19:1-27, 诗篇 68:21-27'],
        151: [False,
              '撒母耳记上 29, 撒母耳记上 30, 撒母耳记上 31, 约翰福音 19:28-42, 约翰福音 20:1-9, '
              '诗篇 68:28-35'],
        152: [False,
              '撒母耳记下 1, 撒母耳记下 2:1-7, 约翰福音 20:10-31, 箴言 13:20-25, 箴言 '
              '14:1-4'],
        153: [False, '撒母耳记下 2:8-32, 撒母耳记下 3:1-21, 约翰福音 21:1-25, 诗篇 69:1-12'],
        154: [False,
              '撒母耳记下 3:22-39, 撒母耳记下 4, 撒母耳记下 5:1-5, 使徒行传 1:1-22, 诗篇 '
              '69:13-28'],
        155: [False,
              '撒母耳记下 5:6-25, 撒母耳记下 6, 使徒行传 1:23-26, 使徒行传 2:1-21, 诗篇 '
              '69:29-36'],
        156: [False, '撒母耳记下 7, 撒母耳记下 8, 使徒行传 2:22-47, 箴言 14:4-14'],
        157: [False, '撒母耳记下 9, 撒母耳记下 10, 使徒行传 3, 诗篇 70:1-5'],
        158: [False, '撒母耳记下 11, 撒母耳记下 12, 使徒行传 4:1-22, 诗篇 71:1-8'],
        159: [False, '撒母耳记下 13, 使徒行传 4:23-37, 使徒行传 5:1-11, 诗篇 71:9-18'],
        160: [False, '撒母耳记下 14, 撒母耳记下 15:1-12, 使徒行传 5:12-42, 箴言 14:15-24'],
        161: [False,
              '撒母耳记下 15:13-37, 撒母耳记下 16:1-14, 使徒行传 6, 使徒行传 7:1-19, 诗篇 '
              '71:19-24'],
        162: [False,
              '撒母耳记下 16:15-23, 撒母耳记下 17, 撒母耳记下 18:1-18, 使徒行传 7:20-43, 诗篇 '
              '72:1-20'],
        163: [False,
              '撒母耳记下 18:19-33, 撒母耳记下 19, 使徒行传 7:44-60, 使徒行传 8:1-3, 诗篇 '
              '73:1-14'],
        164: [False, '撒母耳记下 20, 撒母耳记下 21, 使徒行传 8:4-40, 箴言 14:25-35'],
        165: [False, '撒母耳记下 22, 撒母耳记下 23:1-7, 使徒行传 9:1-31, 诗篇 73:15-28'],
        166: [False,
              '撒母耳记下 23:8-39, 撒母耳记下 24:1-25, 使徒行传 9:32-43, 使徒行传 10:1-23, 诗篇 '
              '74:1-9'],
        167: [False,
              '列王纪上 1, 列王纪上 2:1-12, 使徒行传 10:23-48, 使徒行传 11:1-18, 诗篇 '
              '74:10-17'],
        168: [False,
              '列王纪上 2:13-46, 列王纪上 3:1-15, 使徒行传 11:19-30, 使徒行传 12:1-19, 箴言 '
              '15:1-10'],
        169: [False,
              '列王纪上 3:16-28, 列王纪上 4, 列王纪上 5, 使徒行传 12:19-25, 使徒行传 13:1-12, '
              '诗篇 74:18-23'],
        170: [False, '列王纪上 6, 列王纪上 7:1-22, 使徒行传 13:13-41, 诗篇 75:1-10'],
        171: [False,
              '列王纪上 7:23-51, 列王纪上 8:1-21, 使徒行传 13:42-52, 使徒行传 14:1-7, 诗篇 '
              '76:1-12'],
        172: [False,
              '列王纪上 8:22-66, 列王纪上 9:1-9, 使徒行传 14:8-28, 箴言 15:11-20'],
        173: [False,
              '列王纪上 9:10-28, 列王纪上 10, 列王纪上 11:1-13, 使徒行传 15:1-21, 诗篇 '
              '77:1-9'],
        174: [False,
              '列王纪上 11:14-43, 列王纪上 12:1-24, 使徒行传 15:22-41, 诗篇 77:10-20'],
        175: [False,
              '列王纪上 12:25-33, 列王纪上 13, 列王纪上 14:1-20, 使徒行传 16:1-15, 诗篇 '
              '78:1-8'],
        176: [False,
              '列王纪上 14:21-31, 列王纪上 15, 列王纪上 16:1-7, 使徒行传 16:16-40, 箴言 '
              '15:21-30'],
        177: [False,
              '列王纪上 16:8-34, 列王纪上 17, 列王纪上 18:1-15, 使徒行传 17:1-21, 诗篇 '
              '78:9-16'],
        178: [False,
              '列王纪上 18:16-46, 列王纪上 19, 使徒行传 17:22-34, 使徒行传 18:1-8, 诗篇 '
              '78:17-31'],
        179: [False,
              '列王纪上 20, 列王纪上 21, 使徒行传 18:9-28, 使徒行传 19:1-13, 诗篇 78:32-39'],
        180: [False,
              '列王纪上 22:1-53, 使徒行传 19:14-41, 箴言 15:31-33, 箴言 16:1-7'],
        181: [False, '列王纪下 1, 列王纪下 2:1-25, 使徒行传 20:1-38, 诗篇 78:40-55'],
        182: [False, '列王纪下 3, 列王纪下 4:1-37, 使徒行传 21:1-26, 诗篇 78:56-72'],
        183: [False,
              '列王纪下 4:38-44, 列王纪下 5, 列王纪下 6:1-23, 使徒行传 21:27-40, 使徒行传 '
              '22:1-22, 诗篇 79:1-13'],
        184: [False,
              '列王纪下 6:24-33, 列王纪下 7, 列王纪下 8:1-15, 使徒行传 22:22-30, 使徒行传 '
              '23:1-11, 箴言 16:8-17'],
        185: [False, '列王纪下 8:16-29, 列王纪下 9, 使徒行传 23:12-35, 诗篇 80:1-7'],
        186: [False, '列王纪下 10, 列王纪下 11, 使徒行传 24:1-27, 诗篇 80:8-19'],
        187: [False,
              '列王纪下 12, 列王纪下 13, 列王纪下 14:1-22, 使徒行传 25:1-22, 诗篇 81:1-7'],
        188: [False,
              '列王纪下 14:23-29, 列王纪下 15, 使徒行传 25:23-27, 使徒行传 26:1-23, 箴言 '
              '16:18-27'],
        189: [False,
              '列王纪下 16, 列王纪下 17, 使徒行传 26:24-32, 使徒行传 27:1-12, 诗篇 81:8-16'],
        190: [False, '列王纪下 18, 列王纪下 19:1-13, 使徒行传 27:13-44, 诗篇 82:1-8'],
        191: [False, '列王纪下 19:14-37, 列王纪下 20, 使徒行传 28:1-16, 诗篇 83:1-18'],
        192: [False,
              '列王纪下 21, 列王纪下 22, 使徒行传 28:17-31, 箴言 16:28-33, 箴言 '
              '17:1-4'],
        193: [False, '列王纪下 23, 列王纪下 24:1-7, 罗马书 1:1-17, 诗篇 84:1-7'],
        194: [False, '列王纪下 24:8-20, 列王纪下 25, 罗马书 1:18-32, 诗篇 84:8-12'],
        195: [False,
              '约拿书 1, 约拿书 2, 约拿书 3, 约拿书 4, 罗马书 2:1-16, 诗篇 85:1-7'],
        196: [False, '阿摩司书 1, 阿摩司书 2, 罗马书 2:17-29, 罗马书 3:1-8, 箴言 17:5-14'],
        197: [False, '阿摩司书 3, 阿摩司书 4, 罗马书 3:9-31, 诗篇 85:8-13'],
        198: [False, '阿摩司书 5, 罗马书 4:1-15, 诗篇 86:1-10'],
        199: [False, '阿摩司书 6, 阿摩司书 7, 罗马书 4:16-25, 罗马书 5:1-11, 诗篇 86:11-17'],
        200: [False, '阿摩司书 8, 阿摩司书 9, 罗马书 5:12-21, 箴言 17:15-24'],
        201: [False, '何西阿书 1, 何西阿书 2, 罗马书 6:1-14, 诗篇 87:1-7'],
        202: [False,
              '何西阿书 3, 何西阿书 4, 何西阿书 5, 罗马书 6:15-23, 罗马书 7:1-6, 诗篇 88:1-9'],
        203: [False, '何西阿书 6, 何西阿书 7, 罗马书 7:7-25, 诗篇 88:9-18'],
        204: [False,
              '何西阿书 8, 何西阿书 9, 罗马书 8:1-17, 箴言 17:25-28, 箴言 18:1-6'],
        205: [False, '何西阿书 10, 何西阿书 11, 罗马书 8:18-39, 诗篇 89:1-8'],
        206: [False,
              '何西阿书 11, 何西阿书 12, 何西阿书 13, 何西阿书 14, 罗马书 9:1-21, 诗篇 89:9-13'],
        207: [False,
              '历代志上 1, 历代志上 2:1-17, 罗马书 9:22-33, 罗马书 10:1-4, '
              '诗篇 89:14-18'],
        208: [False,
              '历代志上 2:18-55, 历代志上 3, 历代志上 4:1-8, 罗马书 '
              '10:5-21, 罗马书 11:1-10, 箴言 18:7-16'],
        209: [False,
              '历代志上 4:9-43, 历代志上 5, 罗马书 11:11-32, 诗篇 89:19-29'],
        210: [False,
              '历代志上 6, 罗马书 11:33-36, 罗马书 12:1-21, 诗篇 89:30-37'],
        211: [False, '历代志上 7, 历代志上 8, 罗马书 13:1-14, 诗篇 89:38-45'],
        212: [False,
              '历代志上 9, 历代志上 10:1-14, 罗马书 14:1-18, 箴言 '
              '18:17-24, 箴言 19:1-2'],
        213: [False,
              '历代志上 11, 历代志上 12:1-22, 罗马书 14:19-23, 罗马书 '
              '15:1-13, 诗篇 89:46-52'],
        214: [False,
              '历代志上 12:23-40, 历代志上 13, 历代志上 14, 罗马书 '
              '15:14-33, 诗篇 90:1-10'],
        215: [False,
              '历代志上 15, 历代志上 16:1-36, 罗马书 16, 诗篇 90:11-17'],
        216: [False,
              '历代志上 16:37-43, 历代志上 17, 历代志上 18, 哥林多前书 '
              '1:1-17, 箴言 19:3-12'],
        217: [False,
              '历代志上 19, 历代志上 20, 历代志上 21, 哥林多前书 '
              '1:18-31, 哥林多前书 2:1-5, 诗篇 91:1-8'],
        218: [False,
              '历代志上 22, 历代志上 23, 哥林多前书 2:6-16, 诗篇 91:9-16'],
        219: [False,
              '历代志上 24, 历代志上 25, 历代志上 26:1-19, 哥林多前书 '
              '3, 诗篇 92:1-15'],
        220: [False,
              '历代志上 26:20-32, 历代志上 27, 哥林多前书 4, 箴言 '
              '19:13-22'],
        221: [False,
              '历代志上 28, 历代志上 29, 哥林多前书 5, 诗篇 93:1-5'],
        222: [False, '历代志下 1:1-17, 哥林多前书 6, 诗篇 94:1-11'],
        223: [False,
              '传道书 1, 传道书 2, 传道书 3:1-22, 哥林多前书 '
              '7:1-16, 诗篇 94:12-23'],
        224: [False,
              '传道书 4, 传道书 5, 传道书 6, 哥林多前书 7:17-35, '
              '箴言 19:23-29, 箴言 20:1-4'],
        225: [False,
              '传道书 7, 传道书 8, 传道书 9:1-12, 哥林多前书 '
              '7:36-40, 哥林多前书 8:1-13, 诗篇 95:1-11'],
        226: [False,
              '传道书 9:13-18, 传道书 10, 传道书 11, 传道书 '
              '12, 哥林多前书 9:1-18, 诗篇 96:1-13'],
        227: [False,
              '历代志下 2, 历代志下 3, 历代志下 4, 历代志下 5:1, 哥林多前书 9:19-27, 哥林多前书 10:1-13, 诗篇 97:1-12'],
        228: [False,
              '历代志下 5:2-14, 历代志下 6, 历代志下 7:1-10, 哥林多前书 10:14-33, 哥林多前书 11:1, 箴言 20:5-14'],
        229: [False,
              '历代志下 7:11-22, 历代志下 8, 历代志下 9, 哥林多前书 '
              '11:2-34, 诗篇 98:1-9'],
        230: [False,
              '雅歌 1, 雅歌 2, 雅歌 3, 雅歌 4, 哥林多前书 12:1-26, 诗篇 99:1-9'],
        231: [False,
              '雅歌 5, 雅歌 6, 雅歌 7, 雅歌 8, 哥林多前书 12:27-31, 哥林多前书 '
              '13:1-13, 诗篇 100:1-5'],
        232: [False,
              '历代志下 10, 历代志下 11, 历代志下 12, 哥林多前书 '
              '14:1-19, 箴言 20:15-24'],
        233: [False,
              '历代志下 13, 历代志下 14, 历代志下 15, 哥林多前书 '
              '14:20-40, 诗篇 101:1-8'],
        234: [False,
              '历代志下 16, 历代志下 17, 历代志下 18:1-27, 哥林多前书 '
              '15:1-34, 诗篇 102:1-11'],
        235: [False,
              '历代志下 18:28-34, 历代志下 19, 历代志下 20, 哥林多前书 '
              '15:35-49, 诗篇 102:12-17'],
        236: [False,
              '历代志下 21, 历代志下 22, 历代志下 23, 哥林多前书 '
              '15:50-58, 哥林多前书 16:1-4, 箴言 20:25-30, 箴言 21:1-4'],
        237: [False,
              '历代志下 24, 历代志下 25, 哥林多前书 16:5-24, 诗篇 '
              '102:18-28'],
        238: [False,
              '历代志下 26, 历代志下 27, 历代志下 28, 哥林多后书 '
              '1:1-11, 诗篇 103:1-12'],
        239: [False,
              '历代志下 29, 历代志下 30, 历代志下 31:1, 哥林多后书 '
              '1:12-22, 诗篇 103:13-22'],
        240: [False,
              '历代志下 31:2-21, 历代志下 32, 历代志下 33:1-20, 哥林多后书 1:23, 哥林多后书 2:1-11, 箴言 21:5-16'],
        241: [False,
              '历代志下 33:21-24, 历代志下 34, 历代志下 35:1-19, 哥林多后书 2:12-17, 哥林多后书 3:1-6, 诗篇 104:1-18'],
        242: [False,
              '历代志下 35:20-27, 历代志下 36, 哥林多后书 3:7-18, 诗篇 '
              '104:19-30'],
        243: [False,
              '弥迦书 1, 弥迦书 2, 弥迦书 3, 弥迦书 4, 哥林多后书 4, 诗篇 104:31-35'],
        244: [False,
              '弥迦书 5, 弥迦书 6, 弥迦书 7, 哥林多后书 5:1-10, 箴言 21:17-26'],
        245: [False,
              '以赛亚书 1, 以赛亚书 2, 哥林多后书 5:11-21, 哥林多后书 6:1-2, 诗篇 '
              '105:1-11'],
        246: [False,
              '以赛亚书 3, 以赛亚书 4, 以赛亚书 5:1-7, 哥林多后书 6:3-18, 哥林多后书 '
              '7:1, 诗篇 105:12-22'],
        247: [False,
              '以赛亚书 5:8-30, 以赛亚书 6, 以赛亚书 7, 以赛亚书 8:1-10, 哥林多后书 '
              '7:2-16, 诗篇 105:23-36'],
        248: [False,
              '以赛亚书 8:11-22, 以赛亚书 9, 以赛亚书 10:1-19, 哥林多后书 8:1-15, '
              '箴言 21:27-31, 箴言 22:1-6'],
        249: [False,
              '以赛亚书 10:20-34, 以赛亚书 11, 以赛亚书 12, 以赛亚书 13, 哥林多后书 '
              '8:16-24, 哥林多后书 9:1-5, 诗篇 105:37-45'],
        250: [False,
              '以赛亚书 14, 以赛亚书 15, 以赛亚书 16, 哥林多后书 9:6-15, 诗篇 106:1-15'],
        251: [False,
              '以赛亚书 17, 以赛亚书 18, 以赛亚书 19, 哥林多后书 10, 诗篇 106:16-31'],
        252: [False,
              '以赛亚书 20, 以赛亚书 21, 以赛亚书 22, 以赛亚书 23, 哥林多后书 11:1-15, '
              '箴言 22:7-16'],
        253: [False,
              '以赛亚书 24, 以赛亚书 25, 以赛亚书 26, 哥林多后书 11:16-33, 诗篇 '
              '106:32-39'],
        254: [False, '以赛亚书 27, 以赛亚书 28, 哥林多后书 12:1-10, 诗篇 106:40-48'],
        255: [False,
              '以赛亚书 29, 以赛亚书 30:1-18, 哥林多后书 12:11-21, 诗篇 107:1-9'],
        256: [False,
              '以赛亚书 30:19-33, 以赛亚书 31, 以赛亚书 32, 哥林多后书 13, 箴言 '
              '22:17-27'],
        257: [False, '以赛亚书 33, 以赛亚书 34, 以赛亚书 35, 加拉太书 1, 诗篇 107:10-22'],
        258: [False, '以赛亚书 36, 以赛亚书 37, 加拉太书 2:1-10, 诗篇 107:23-32'],
        259: [False,
              '以赛亚书 38, 以赛亚书 39, 以赛亚书 40, 加拉太书 2:11-21, 加拉太书 3:1-9, '
              '诗篇 107:33-43'],
        260: [False,
              '以赛亚书 41, 以赛亚书 42, 加拉太书 3:10-25, 箴言 22:28-29, 箴言 '
              '23:1-9'],
        261: [False,
              '以赛亚书 43, 以赛亚书 44:1-23, 加拉太书 3:26-29, 加拉太书 4:1-20, 诗篇 '
              '108:1-5'],
        262: [False,
              '以赛亚书 44:24-28, 以赛亚书 45, 以赛亚书 46, 加拉太书 4:21-31, 加拉太书 '
              '5:1-6, 诗篇 108:6-13'],
        263: [False,
              '以赛亚书 47, 以赛亚书 48, 以赛亚书 49:1-7, 加拉太书 5:7-26, 诗篇 109:1-20'],
        264: [False,
              '以赛亚书 49:8-26, 以赛亚书 50, 以赛亚书 51:1-16, 加拉太书 6, 箴言 '
              '23:10-18'],
        265: [False,
              '以赛亚书 51:17-23, 以赛亚书 52, 以赛亚书 53, 以赛亚书 54, 以弗所书 1, 诗篇 '
              '109:21-31'],
        266: [False,
              '以赛亚书 55, 以赛亚书 56, 以赛亚书 57:1-13, 以弗所书 2, 诗篇 110:1-7'],
        267: [False,
              '以赛亚书 57:14-21, 以赛亚书 58, 以赛亚书 59, 以弗所书 3, 诗篇 111:1-10'],
        268: [False,
              '以赛亚书 60, 以赛亚书 61, 以赛亚书 62, 以弗所书 4:1-16, 箴言 23:19-28'],
        269: [False,
              '以赛亚书 63, 以赛亚书 64, 以赛亚书 65:1-16, 以弗所书 4:17-32, 以弗所书 '
              '5:1-7, 诗篇 112:1-10'],
        270: [False, '以赛亚书 65:17-25, 以赛亚书 66, 以弗所书 5:8-33, 诗篇 113:1-9'],
        271: [False, '那鸿书 1, 那鸿书 2, 那鸿书 3, 以弗所书 6, 诗篇 114:1-8'],
        272: [False,
              '西番雅书 1, 西番雅书 2, 西番雅书 3, 腓立比书 1:1-26, 箴言 '
              '23:29-35, 箴言 24:1-4'],
        273: [False,
              '耶利米书 1, 耶利米书 2:1-30, 腓立比书 1:27-30, 腓立比书 2:1-11, '
              '诗篇 115:1-11'],
        274: [False,
              '耶利米书 2:31-47, 耶利米书 3, 耶利米书 4:1-9, 腓立比书 2:12-30, '
              '诗篇 115:12-18'],
        275: [False,
              '耶利米书 4:10-31, 耶利米书 5, 腓立比书 3, 腓立比书 4:1, 诗篇 '
              '116:1-11'],
        276: [False,
              '耶利米书 6, 耶利米书 7:1-29, 腓立比书 4:2-23, 箴言 24:5-14'],
        277: [False,
              '耶利米书 7:30-34, 耶利米书 8, 耶利米书 9:1-16, 歌罗西书 1:1-23, '
              '诗篇 116:12-19'],
        278: [False,
              '耶利米书 9:17-26, 耶利米书 10, 耶利米书 11:1-17, 歌罗西书 1:24-29, '
              '歌罗西书 2:1-5, 诗篇 117:1-2'],
        279: [False,
              '耶利米书 11:18-23, 耶利米书 12, 耶利米书 13, 歌罗西书 2:6-23, 诗篇 '
              '118:1-16'],
        280: [False,
              '耶利米书 14, 耶利米书 15, 歌罗西书 3, 歌罗西书 4:1, 箴言 '
              '24:15-22'],
        281: [False, '耶利米书 16, 耶利米书 17, 歌罗西书 4:2-18, 诗篇 118:17-29'],
        282: [False,
              '耶利米书 18, 耶利米书 19, 耶利米书 20, 帖撒罗尼迦前书 1, 帖撒罗尼迦前书 2:1-16, 诗篇 119:1-8'],
        283: [False,
              '耶利米书 21, 耶利米书 22, 耶利米书 23:1-8, 帖撒罗尼迦前书 2:17-19, 帖撒罗尼迦前书 3, 诗篇 119:9-16'],
        284: [False,
              '耶利米书 23:9-40, 耶利米书 24, 耶利米书 25:1-14, 帖撒罗尼迦前书 4, '
              '箴言 24:23-34'],
        285: [False,
              '耶利米书 25:15-38, 耶利米书 26, 帖撒罗尼迦前书 5, 诗篇 119:17-24'],
        286: [False,
              '耶利米书 27, 耶利米书 28, 耶利米书 29:1-23, 帖撒罗尼迦后书 1, 诗篇 '
              '119:25-32'],
        287: [False,
              '耶利米书 29:24-32, 耶利米书 30, 耶利米书 31:1-14, 帖撒罗尼迦后书 2, '
              '诗篇 119:33-40'],
        288: [False,
              '耶利米书 31:15-40, 耶利米书 32:1-25, 帖撒罗尼迦后书 3, 箴言 '
              '25:1-10'],
        289: [False,
              '耶利米书 32:26-44, 耶利米书 33, 耶利米书 34, 提摩太前书 1, 诗篇 '
              '119:41-48'],
        290: [False,
              '耶利米书 35, 耶利米书 36, 耶利米书 37, 提摩太前书 2, 诗篇 119:49-56'],
        291: [False,
              '耶利米书 38, 耶利米书 39, 耶利米书 40:1-6, 提摩太前书 3, 诗篇 '
              '119:57-64'],
        292: [False,
              '耶利米书 40:7-16, 耶利米书 41, 耶利米书 42, 提摩太前书 4, 箴言 '
              '25:11-20'],
        293: [False,
              '耶利米书 43, 耶利米书 44, 耶利米书 45, 提摩太前书 5, 提摩太前书 6:1-2, '
              '诗篇 119:65-72'],
        294: [False, '耶利米书 46, 耶利米书 47, 提摩太前书 6:3-21, 诗篇 119:73-80'],
        295: [False, '耶利米书 48, 耶利米书 49:1-6, 提摩太后书 1, 诗篇 119:81-88'],
        296: [False,
              '耶利米书 49:7-39, 耶利米书 50:1-10, 提摩太后书 2, 箴言 25:21-28, '
              '箴言 26:1-2'],
        297: [False,
              '耶利米书 50:11-46, 耶利米书 51:1-14, 提摩太后书 3, 诗篇 119:89-96'],
        298: [False, '耶利米书 51:15-64, 提摩太后书 4, 诗篇 119:97-104'],
        299: [False, '耶利米书 52, 提多书 1, 诗篇 119:105-112'],
        300: [False,
              '哈巴谷书 1, 哈巴谷书 2, 哈巴谷书 3:1-19, 提多书 2, 箴言 26:3-12'],
        301: [False, '耶利米哀歌 1, 耶利米哀歌 2:1-6, 提多书 3, 诗篇 119:113-120'],
        302: [False,
              '耶利米哀歌 2:7-27, 耶利米哀歌 3:1-39, 腓利门书 1, 诗篇 '
              '119:121-128'],
        303: [False,
              '耶利米哀歌 3:40-66, 耶利米哀歌 4, 耶利米哀歌 5, 希伯来书 1, 诗篇 '
              '119:129-136'],
        304: [False, '俄巴底亚书 1, 希伯来书 2, 箴言 26:13-22'],
        305: [False, '约珥书 1, 约珥书 2:1-17, 希伯来书 3, 诗篇 119:137-144'],
        306: [False, '约珥书 2:18-32, 约珥书 3, 希伯来书 4:1-13, 诗篇 119:145-152'],
        307: [False,
              '以西结书 1, 以西结书 2, 以西结书 3, 希伯来书 4:14-16, 希伯来书 5:1-10, '
              '诗篇 119:153-160'],
        308: [False,
              '以西结书 4, 以西结书 5, 以西结书 6, 希伯来书 5:11-14, 希伯来书 6:1-12, '
              '箴言 26:23-28, 箴言 27:1-4'],
        309: [False,
              '以西结书 7, 以西结书 8, 以西结书 9, 希伯来书 6:13-20, 希伯来书 7:1-10, '
              '诗篇 119:161-168'],
        310: [False,
              '以西结书 10, 以西结书 11, 以西结书 12, 希伯来书 7:11-28, 诗篇 '
              '119:169-176'],
        311: [False, '以西结书 13, 以西结书 14, 以西结书 15, 希伯来书 8, 诗篇 120:1-7'],
        312: [False, '以西结书 16, 希伯来书 9:1-15, 箴言 27:5-14'],
        313: [False, '以西结书 17, 以西结书 18, 希伯来书 9:16-28, 诗篇 121:1-8'],
        314: [False, '以西结书 19, 以西结书 20:1-44, 希伯来书 10:1-18, 诗篇 122:1-9'],
        315: [False,
              '以西结书 20:45-49, 以西结书 21, 以西结书 22:1-22, 希伯来书 10:19-39, 诗篇 '
              '123:1-4'],
        316: [False,
              '以西结书 22:23-31, 以西结书 23, 希伯来书 11:1-16, 箴言 27:15-22'],
        317: [False, '以西结书 24, 以西结书 25, 希伯来书 11:17-40, 诗篇 124:1-8'],
        318: [False, '以西结书 26, 以西结书 27, 希伯来书 12:1-13, 诗篇 125:1-5'],
        319: [False, '以西结书 28, 以西结书 29, 希伯来书 12:14-29, 诗篇 126:1-6'],
        320: [False,
              '以西结书 30, 以西结书 31, 希伯来书 13, 箴言 27:23-27, 箴言 '
              '28:1-6'],
        321: [False, '以西结书 32, 以西结书 33:1-32, 雅各书 1, 诗篇 127:1-5'],
        322: [False,
              '以西结书 33:21-33, 以西结书 34, 以西结书 35, 雅各书 2, 诗篇 128:1-6'],
        323: [False, '以西结书 36, 以西结书 37, 雅各书 3, 诗篇 129:1-8'],
        324: [False, '以西结书 38, 以西结书 39, 雅各书 4, 箴言 28:7-17'],
        325: [False, '以西结书 40, 雅各书 5, 诗篇 130:1-8'],
        326: [False,
              '以西结书 41, 以西结书 42, 彼得前书 1, 彼得前书 2:1-3, 诗篇 131:1-3'],
        327: [False, '以西结书 43, 以西结书 44, 彼得前书 2:4-25, 诗篇 132:1-18'],
        328: [False, '以西结书 45, 以西结书 46, 彼得前书 3, 箴言 28:18-28'],
        329: [False, '以西结书 47, 以西结书 48, 彼得前书 4, 诗篇 133:1-3'],
        330: [False, '但以理书 1, 但以理书 2:1-23, 彼得前书 5, 诗篇 134:1-3'],
        331: [False, '但以理书 2:24-49, 但以理书 3:1-12, 彼得后书 1, 诗篇 135:1-12'],
        332: [False, '但以理书 3:13-30, 但以理书 4:1-18, 彼得后书 2, 箴言 29:1-9'],
        333: [False, '但以理书 4:19-37, 但以理书 5:1-16, 彼得后书 3, 诗篇 135:13-21'],
        334: [False,
              '但以理书 5:17-31, 但以理书 6:1-28, 约翰一书 1, 约翰一书 2, 诗篇 136:1-12'],
        335: [False, '但以理书 7, 但以理书 8:1-14, 约翰一书 2:12-27, 诗篇 136:13-26'],
        336: [False,
              '但以理书 8:15-27, 但以理书 9:1-19, 约翰一书 2:28-29, 约翰一书 3:1-10, 箴言 '
              '29:10-18'],
        337: [False,
              '但以理书 9:20-27, 但以理书 10, 但以理书 11:1, 约翰一书 3:11-24, 约翰一书 4:1-6, '
              '诗篇 137:1-9'],
        338: [False, '但以理书 11:2-35, 约翰一书 4:7-21, 诗篇 138:1-8'],
        339: [False, '但以理书 11:36-45, 但以理书 12, 约翰一书 5:1-21, 诗篇 139:1-10'],
        340: [False, '哈该书 1, 哈该书 2:1-23, 约翰二书 1:1-13, 箴言 29:19-27'],
        341: [False,
              '撒迦利亚书 1, 撒迦利亚书 2, 撒迦利亚书 3, 撒迦利亚书 4, 约翰三书 1:1-14, '
              '诗篇 139:11-16'],
        342: [False,
              '撒迦利亚书 5, 撒迦利亚书 6, 撒迦利亚书 7, 撒迦利亚书 8, 犹大书 1:1-25, 诗篇 '
              '139:17-24'],
        343: [False,
              '撒迦利亚书 9, 撒迦利亚书 10, 撒迦利亚书 11, 启示录 1, 诗篇 140:1-5'],
        344: [False,
              '撒迦利亚书 12, 撒迦利亚书 13, 撒迦利亚书 14, 启示录 2:1-17, 箴言 '
              '30:1-10'],
        345: [False,
              '以斯帖记 1, 以斯帖记 2:1-18, 启示录 2:18-29, 启示录 3:1-6, 诗篇 '
              '140:6-13'],
        346: [False,
              '以斯帖记 2:19-23, 以斯帖记 3, 以斯帖记 4, 以斯帖记 5, 启示录 3:7-22, 诗篇 '
              '141:1-10'],
        347: [False, '以斯帖记 6, 以斯帖记 7, 以斯帖记 8, 启示录 4, 诗篇 142:1-11'],
        348: [False, '以斯帖记 9, 以斯帖记 10, 启示录 5, 箴言 30:11-23'],
        349: [False, '玛拉基书 1, 玛拉基书 2:1-16, 启示录 6, 诗篇 143:1-12'],
        350: [False,
              '玛拉基书 2:17, 玛拉基书 3, 玛拉基书 4, 启示录 7, 诗篇 144:1-8'],
        351: [False,
              '以斯拉记 1, 以斯拉记 2:1-67, 启示录 8, 启示录 9:1-12, 诗篇 144:9-15'],
        352: [False,
              '以斯拉记 2:68-70, 以斯拉记 3, 以斯拉记 4:1-5, 启示录 9:13-21, 启示录 10, '
              '箴言 30:24-33'],
        353: [False, '以斯拉记 4:6-24, 以斯拉记 5, 启示录 11, 诗篇 145:1-7'],
        354: [False,
              '以斯拉记 6, 以斯拉记 7:1-10, 启示录 12, 启示录 13:1, 诗篇 145:8-13'],
        355: [False, '以斯拉记 7:11-28, 以斯拉记 8:1-14, 启示录 13:1-18, 诗篇 145:13-21'],
        356: [False, '以斯拉记 8:15-36, 以斯拉记 9:1-15, 启示录 14:1-13, 箴言 31:1-9'],
        357: [False, '以斯拉记 10, 启示录 14:14-20, 启示录 15, 诗篇 146:1-10'],
        358: [False, '尼希米记 1, 尼希米记 2, 启示录 16, 诗篇 147:1-11'],
        359: [False, '尼希米记 3, 尼希米记 4, 启示录 17, 诗篇 147:12-20'],
        360: [False,
              '尼希米记 5, 尼希米记 6, 尼希米记 7:1-3, 启示录 18:1-17, 箴言 '
              '31:10-20'],
        361: [False,
              '尼希米记 7:4-73, 尼希米记 8, 启示录 18:17-24, 启示录 19:1-10, '
              '诗篇 148:1-6'],
        362: [False, '尼希米记 9:1-37, 启示录 19:11-21, 诗篇 148:7-14'],
        363: [False,
              '尼希米记 9:38, 尼希米记 10, 尼希米记 11:1-21, 启示录 20, 诗篇 '
              '149:1-9'],
        364: [False,
              '尼希米记 11:22-36, 尼希米记 12:1-47, 启示录 21, 箴言 31:21-31'],
        365: [False, '尼希米记 13, 启示录 22, 诗篇 150:1-6'],
    }

    translation = (
        "圣经阅读计划",
        "今天是",
        "搜索：",
        "圣经视窗页签中开启",
        "隐藏已经阅读的经文",
        "显示已经阅读的经文",
        "重新设置",
        "储存阅读进度",
        "第",
        "天",
        "您的阅读进度储存在下面这个档案：",
        "没法把您的阅读进度储存在您现在使用的电脑上！",
    )

    def __init__(self, parent):
        super().__init__()
        self.parent = parent
        # set title
        self.setWindowTitle(self.translation[0])
        self.setMinimumSize(830, 500)
        # set variables
        self.setupVariables()
        # setup interface
        self.setupUI()

    def setupVariables(self):
        import copy, os
        from datetime import date
        self.today = date.today()
        self.todayNo = int(format(self.today, '%j'))
        if self.todayNo > 365:
            self.todayNo = 365
        self.progressFile = os.path.join(os.getcwd(), "plugins", "menu", "{0}.txt".format(self.translation[0]))
        if os.path.isfile(self.progressFile):
            from ast import literal_eval
            with open(self.progressFile, "r") as fileObj:
                self.plan = literal_eval(fileObj.read())
        else:
            self.plan = copy.deepcopy(self.template)
        self.hideCheckedItems = False

    def setupUI(self):
        from qtpy.QtGui import QStandardItemModel
        from qtpy.QtWidgets import (QPushButton, QLabel, QListView, QAbstractItemView, QHBoxLayout, QVBoxLayout, QLineEdit)

        mainLayout = QVBoxLayout()

        readingListLayout = QVBoxLayout()

        readingListLayout.addWidget(QLabel(self.translation[0]))
        readingListLayout.addWidget(QLabel("{0}{1}".format(self.translation[1], self.today)))

        filterLayout = QHBoxLayout()
        filterLayout.addWidget(QLabel(self.translation[2]))
        self.filterEntry = QLineEdit()
        self.filterEntry.textChanged.connect(self.resetItems)
        filterLayout.addWidget(self.filterEntry)
        readingListLayout.addLayout(filterLayout)

        self.readingList = QListView()
        self.readingList.setEditTriggers(QAbstractItemView.NoEditTriggers)
        self.readingListModel = QStandardItemModel(self.readingList)
        self.readingList.setModel(self.readingListModel)
        self.resetItems()
        self.readingListModel.itemChanged.connect(self.itemChanged)
        #print(self.readingList.currentIndex().row())
        #self.readingList.selectionModel().selectionChanged.connect(self.function)
        readingListLayout.addWidget(self.readingList)

        buttonsLayout = QHBoxLayout()

        button = QPushButton(self.translation[3])
        button.clicked.connect(self.openInTabs)
        buttonsLayout.addWidget(button)

        self.hideShowButton = QPushButton(self.translation[4])
        self.hideShowButton.clicked.connect(self.hideShowCheckedItems)
        buttonsLayout.addWidget(self.hideShowButton)

        button = QPushButton(self.translation[6])
        button.clicked.connect(self.resetAllItems)
        buttonsLayout.addWidget(button)

        button = QPushButton(self.translation[7])
        button.clicked.connect(self.saveProgress)
        buttonsLayout.addWidget(button)

        mainLayout.addLayout(readingListLayout)
        mainLayout.addLayout(buttonsLayout)

        self.setLayout(mainLayout)

    def itemChanged(self, standardItem):
        from qtpy.QtCore import Qt
        key = int(standardItem.text().split(".")[0])
        if standardItem.checkState() is Qt.CheckState.Checked:
            self.plan[key][0] = True
        elif standardItem.checkState() is Qt.CheckState.Unchecked:
            self.plan[key][0] = False
        if self.hideCheckedItems:
            self.resetItems()

    def resetItems(self):
        from qtpy.QtGui import QStandardItem
        from qtpy.QtCore import Qt
        # Empty the model before reset
        self.readingListModel.clear()
        # Reset
        index = 0
        todayIndex = None
        filterEntry = self.filterEntry.text()
        for key, value in self.plan.items():
            checked, passages = value
            if not (self.hideCheckedItems and checked) and (filterEntry == "" or (filterEntry != "" and filterEntry.lower() in passages.lower())):
                item = QStandardItem("{0}. {1}".format(key, passages))
                item.setToolTip("{0}{1}{2}".format(self.translation[8], key, self.translation[9]))
                if key == self.todayNo:
                    todayIndex = index
                item.setCheckable(True)
                item.setCheckState(Qt.CheckState.Checked if checked else Qt.CheckState.Unchecked)
                self.readingListModel.appendRow(item)
                index += 1
        if todayIndex is not None:
            self.readingList.setCurrentIndex(self.readingListModel.index(todayIndex, 0))

    def hideShowCheckedItems(self):
        self.hideCheckedItems = not self.hideCheckedItems
        self.resetItems()
        self.hideShowButton.setText(self.translation[5] if self.hideCheckedItems else self.translation[4])

    def resetAllItems(self):
        import copy
        self.plan = copy.deepcopy(self.template)
        self.resetItems()

    def translateIntoChinese(self):
        import copy, pprint
        from BibleBooks import BibleBooks
        plan = copy.deepcopy(self.template)
        filePath = "{0}_zh".format(self.progressFile)
        with open(filePath, "w", encoding="utf-8") as fileObj:
            fileObj.write(pprint.pformat(plan))
        with open(filePath, "r") as fileObj:
            text = fileObj.read()
        translateDict = {}
        bookNames = []
        for key, value in BibleBooks.eng.items():
            bookName = value[-1]
            bookNames.append(bookName)
            translateDict[bookName] = BibleBooks.sc[key][-1]
        bookNames = sorted(bookNames, key=len, reverse=True)
        #print(bookNames)
        for name in bookNames:
            text = text.replace(name, translateDict[name])
        text = text.replace("Psalm", "诗篇")
        with open(filePath, "w", encoding="utf-8") as fileObj:
            fileObj.write(text)

    def saveProgress(self):
        import pprint
        from qtpy.QtWidgets import QMessageBox
        try:
            with open(self.progressFile, "w", encoding="utf-8") as fileObj:
                fileObj.write(pprint.pformat(self.plan))
            message = "{0}\n'{1}'".format(self.translation[10], self.progressFile)
        except:
            message = self.translation[11]
        QMessageBox.information(self, self.translation[0], message)

    def openInTabs(self):
        dayNo = self.readingList.currentIndex().row() + 1
        todayReading = self.plan[dayNo][-1].split(", ")
        openBibleWindowContentOnNextTab = config.openBibleWindowContentOnNextTab
        config.openBibleWindowContentOnNextTab = True
        for reading in todayReading:
            command = "MAIN:::{0}".format(reading)
            self.parent.runTextCommand(command)
        config.openBibleWindowContentOnNextTab = openBibleWindowContentOnNextTab
        self.close()

config.mainWindow.bibleReadingPlan = BibleReadingPlan(config.mainWindow)
config.mainWindow.bibleReadingPlan.show()
