import config
from qtpy.QtWidgets import QWidget


class BibleReadingPlan(QWidget):

    template = {
        # Source / credits of the following plan: https://www.biblica.com/resources/reading-plans/
        1: [False, '創世記 1, 創世記 2:1-17, 馬太福音 1:1-25, 詩篇 1:1-6'],
        2: [False,
            '創世記 2:18-25, 創世記 3, 創世記 4:1-16, 馬太福音 2:1-18, 詩篇 '
            '2:1-12'],
        3: [False,
            '創世記 4:17-26, 創世記 5, 創世記 6, 馬太福音 2:19-23, 馬太福音 3, 詩篇 '
            '3:1-8'],
        4: [False,
            '創世記 7, 創世記 8, 創世記 9:1-17, 馬太福音 4:1-22, 箴言 1:1-7'],
        5: [False,
            '創世記 9:18-29, 創世記 10, 創世記 11:1-9, 馬太福音 4:23-25, 馬太福音 '
            '5:1-20, 詩篇 4:1-8'],
        6: [False,
            '創世記 11:10-32, 創世記 12, 創世記 13, 馬太福音 5:21-42, 詩篇 5:1-12'],
        7: [False,
            '創世記 14, 創世記 15, 創世記 16, 馬太福音 5:43-48, 馬太福音 6:1-24, '
            '詩篇 6'],
        8: [False,
            '創世記 17, 創世記 18, 馬太福音 6:25-34, 馬太福音 7:1-23, 箴言 '
            '1:8-19'],
        9: [False,
            '創世記 19, 創世記 20:1-18, 馬太福音 7:24-29, 馬太福音 8:1-22, 詩篇 '
            '7:1-9'],
        10: [False,
             '創世記 21, 創世記 22, 創世記 23, 馬太福音 8:23-34, 馬太福音 9:1-13, '
             '詩篇 7:10-17'],
        11: [False, '創世記 24:1-67, 馬太福音 9:14-38, 詩篇 8:1-9'],
        12: [False, '創世記 25, 創世記 26, 馬太福音 10:1-31, 箴言 1:20-33'],
        13: [False,
             '創世記 27, 創世記 28:1-22, 馬太福音 10:32-42, 馬太福音 11:1-15, 詩篇 '
             '9:1-6'],
        14: [False, '創世記 29, 創世記 30, 馬太福音 11:16-30, 詩篇 9:7-12'],
        15: [False, '創世記 31:1-55, 馬太福音 12:1-21, 詩篇 9:13-20'],
        16: [False, '創世記 32, 創世記 33, 馬太福音 12:22-45, 箴言 2:1-11'],
        17: [False,
             '創世記 34, 創世記 35, 馬太福音 12:46-50, 馬太福音 13:1-17, 詩篇 '
             '10:1-11'],
        18: [False, '創世記 36, 創世記 37, 馬太福音 13:18-35, 詩篇 10:12-18'],
        19: [False, '創世記 38, 創世記 39, 馬太福音 13:36-58, 詩篇 11:1-7'],
        20: [False, '創世記 40, 創世記 41:1-40, 馬太福音 14:1-21, 箴言 2:12-22'],
        21: [False,
             '創世記 41:41-57, 創世記 42, 馬太福音 14:22-36, 馬太福音 15:1-9, 詩篇 '
             '12:1-8'],
        22: [False, '創世記 43, 創世記 44, 馬太福音 15:10-39, 詩篇 13:1-6'],
        23: [False,
             '創世記 45, 創世記 46, 創世記 47:1-12, 馬太福音 16:1-20, 詩篇 14:1-7'],
        24: [False,
             '創世記 47:13-31, 創世記 48, 馬太福音 16:21-28, 馬太福音 17:1-13, '
             '箴言 3:1-10'],
        25: [False,
             '創世記 49, 創世記 50, 馬太福音 17:14-27, 馬太福音 18:1-9, 詩篇 15:1-5'],
        26: [False, '約伯記 1, 約伯記 2, 約伯記 3, 馬太福音 18:10-35, 詩篇 16:1-11'],
        27: [False, '約伯記 4, 約伯記 5, 約伯記 6, 約伯記 7, 馬太福音 19:1-15, 詩篇 17:1-5'],
        28: [False, '約伯記 8, 約伯記 9, 約伯記 10, 馬太福音 19:16-30, 箴言 3:11-20'],
        29: [False, '約伯記 11, 約伯記 12, 約伯記 13, 約伯記 14, 馬太福音 20:1-19, 詩篇 17:6-12'],
        30: [False,
             '約伯記 15, 約伯記 16, 約伯記 17, 約伯記 18, 馬太福音 20:20-34, 詩篇 17:13-15'],
        31: [False, '約伯記 19, 約伯記 20, 約伯記 21, 馬太福音 21:1-17, 詩篇 18:1-6'],
        32: [False, '約伯記 22, 約伯記 23, 約伯記 24, 馬太福音 21:18-32, 箴言 3:21-35'],
        33: [False,
             '約伯記 25, 約伯記 26, 約伯記 27, 約伯記 28, 約伯記 29, 馬太福音 21:33-46, 馬太福音 '
             '22:1-14, 詩篇 18:7-15'],
        34: [False, '約伯記 30, 約伯記 31, 約伯記 32, 馬太福音 22:15-46, 詩篇 18:16-24'],
        35: [False, '約伯記 33, 約伯記 34, 馬太福音 23:1-39, 詩篇 18:25-36'],
        36: [False, '約伯記 35, 約伯記 36, 約伯記 37, 馬太福音 24:1-31, 箴言 4:1-9'],
        37: [False,
             '約伯記 38, 約伯記 39, 約伯記 40:1-2, 馬太福音 24:32-51, 馬太福音 25:1-13, 詩篇 '
             '18:37-42'],
        38: [False, '約伯記 40:3-24, 約伯記 41, 約伯記 42, 馬太福音 25:14-46, 詩篇 18:43-50'],
        39: [False, '出埃及記 1, 出埃及記 2, 出埃及記 3, 馬太福音 26:1-30, 詩篇 19:1-6'],
        40: [False,
             '出埃及記 4, 出埃及記 5, 出埃及記 6:1-12, 馬太福音 26:31-46, 箴言 4:10-19'],
        41: [False,
             '出埃及記 6:13-30, 出埃及記 7,出埃及記 8, 馬太福音 26:47-68, 詩篇 19:7-14'],
        42: [False,
             '出埃及記 9, 出埃及記 10, 馬太福音 26:69-75, 馬太福音 27:1-10, 詩篇 20:1-9'],
        43: [False, '出埃及記 11, 出埃及記 12, 馬太福音 27:11-44, 詩篇 21:1-7'],
        44: [False, '出埃及記 13, 出埃及記 14, 馬太福音 27:45-66, 箴言 4:20-27'],
        45: [False, '出埃及記 15, 出埃及記 16, 馬太福音 28:1-20, 詩篇 21:8-13'],
        46: [False, '出埃及記 17, 出埃及記 18, 馬可福音 1:1-28, 詩篇 22:1-11'],
        47: [False, '出埃及記 19, 出埃及記 20, 馬可福音 1:29-45, 馬可福音 2:1-17, 詩篇 22:12-21'],
        48: [False,
             '出埃及記 21, 出埃及記 22, 馬可福音 2:18-27, 馬可福音 3:1-30, 箴言 5:1-14'],
        49: [False, '出埃及記 23, 出埃及記 24, 馬可福音 3:31-35, 馬可福音 4:1-29, 詩篇 22:22-31'],
        50: [False, '出埃及記 25, 出埃及記 26, 馬可福音 4:30-41, 馬可福音 5:1-20, 詩篇 23:1-6'],
        51: [False, '出埃及記 27, 出埃及記 28, 馬可福音 5:21-43, 馬可福音 6:1-6, 詩篇 24:1-10'],
        52: [False, '出埃及記 29, 出埃及記 30, 馬可福音 6:7-29, 箴言 5:15-23'],
        53: [False, '出埃及記 31, 出埃及記 32, 出埃及記 33:1-6, 馬可福音 6:30-56, 詩篇 25:1-7'],
        54: [False, '出埃及記 33:7-23, 出埃及記 34, 馬可福音 7:1-30, 詩篇 25:8-15'],
        55: [False, '出埃及記 35, 出埃及記 36, 馬可福音 7:31-37, 馬可福音 8:1-13, 詩篇 25:16-22'],
        56: [False, '出埃及記 37, 出埃及記 38, 馬可福音 8:14-38, 馬可福音 9:1, 箴言 6:1-11'],
        57: [False, '出埃及記 39, 出埃及記 40, 馬可福音 9:2-32, 詩篇 26:1-12'],
        58: [False,
             '利未記 1, 利未記 2, 利未記 3, 馬可福音 9:33-50, 馬可福音 10:1-12, '
             '詩篇 27:1-6'],
        59: [False, '利未記 4, 利未記 5:1-13, 馬可福音 10:13-31, 詩篇 27:7-14'],
        60: [False,
             '利未記 5:14-19, 利未記 6, 利未記 7:1-10, 馬可福音 10:32-52, '
             '箴言 6:12-19'],
        61: [False, '利未記 7:11-38, 利未記 8, 馬可福音 11:1-27, 詩篇 28'],
        62: [False,
             '利未記 9, 利未記 10, 馬可福音 11:28-33, 馬可福音 12:1-12, 詩篇 29'],
        63: [False, '利未記 11, 利未記 12, 馬可福音 12:13-27, 詩篇 30:1-7'],
        64: [False, '利未記 13:1-59, 馬可福音 12:28-44, 箴言 6:20-29'],
        65: [False, '利未記 14:1-57, 馬可福音 13:1-31, 詩篇 30:8-12'],
        66: [False,
             '利未記 15, 利未記 16, 馬可福音 13:32-37, 馬可福音 14:1-16, 詩篇 31:1-8'],
        67: [False, '利未記 17, 利未記 18, 馬可福音 14:17-42, 詩篇 31:9-18'],
        68: [False, '利未記 19, 利未記 20, 馬可福音 14:43-72, 箴言 6:30-35'],
        69: [False, '利未記 21, 利未記 22, 馬可福音 15:1-32, 詩篇 31:19-24'],
        70: [False, '利未記 23, 利未記 24, 馬可福音 15:33-47, 詩篇 32'],
        71: [False, '利未記 25, 利未記 26:1-13, 馬可福音 16:1-20, 詩篇 33:1-11'],
        72: [False, '利未記 26:14-46, 利未記 27, 路加福音 1:1-25, 箴言 7:1-5'],
        73: [False, '民數記 1, 民數記 2:1-9, 路加福音 1:26-38, 詩篇 33:12-22'],
        74: [False, '民數記 2:10-34, 民數記 3, 路加福音 1:39-56, 詩篇 34:1-10'],
        75: [False, '民數記 4, 民數記 5:1-10, 路加福音 1:57-80, 詩篇 34:11-22'],
        76: [False, '民數記 5:11-31, 民數記 6:1-27, 路加福音 2:1-20, 箴言 7:6-20'],
        77: [False, '民數記 7:1-65, 路加福音 2:21-40, 詩篇 35:1-10'],
        78: [False,
             '民數記 7:66-89, 民數記 8, 民數記 9:1-14, 路加福音 2:41-52, 詩篇 '
             '35:11-18'],
        79: [False,
             '民數記 9:15-23, 民數記 10, 民數記 11:1-3, 路加福音 3:1-22, 詩篇 '
             '35:19-28'],
        80: [False,
             '民數記 11:4-35, 民數記 12, 民數記 13:1-25, 路加福音 3:23-38, 路加福音 '
             '4:1-13, 箴言 7:21-27'],
        81: [False, '民數記 13:26-33, 民數記 14, 路加福音 4:14-37, 詩篇 36:1-12'],
        82: [False,
             '民數記 15, 民數記 16:1-35, 路加福音 4:38-44, 路加福音 5:1-16, 詩篇 37:1-9'],
        83: [False,
             '民數記 16:36-50, 民數記 17, 民數記 18, 路加福音 5:17-32, 詩篇 37:10-20'],
        84: [False,
             '民數記 19, 民數記 20, 民數記 21:1-3, 路加福音 5:33-39, 路加福音 6:1-11, '
             '箴言 8:1-11'],
        85: [False, '民數記 21:4-35, 民數記 22:1-20, 路加福音 6:12-36, 詩篇 37:21-31'],
        86: [False,
             '民數記 22:21-41, 民數記 23:1-26, 路加福音 6:37-49, 路加福音 7:1-10, 詩篇 '
             '37:32-40'],
        87: [False,
             '民數記 23:27-30, 民數記 24, 民數記 25, 路加福音 7:11-35, 詩篇 38:1-11'],
        88: [False, '民數記 26, 民數記 27:1-11, 路加福音 7:36-50, 箴言 8:12-21'],
        89: [False,
             '民數記 27:12-23, 民數記 28, 民數記 29:1-11, 路加福音 8:1-18, 詩篇 '
             '38:12-22'],
        90: [False,
             '民數記 29:12-40, 民數記 30, 民數記 31:1-24, 路加福音 8:19-39, 詩篇 '
             '39:1-13'],
        91: [False,
             '民數記 31:25-54, 民數記 32, 路加福音 8:40-56, 路加福音 9:1-9, 詩篇 40:1-8'],
        92: [False, '民數記 33, 民數記 34, 路加福音 9:10-27, 箴言 8:22-31'],
        93: [False, '民數記 35, 民數記 36:1-12, 路加福音 9:28-56, 詩篇 40:9-17'],
        94: [False,
             '申命記 1, 申命記 2:1-23, 路加福音 9:57-62, 路加福音 10:1-24, 詩篇 '
             '41:1-6'],
        95: [False,
             '申命記 2:24-37, 申命記 3, 申命記 4:1-14, 路加福音 10:25-42, '
             '路加福音 11:1-4, 詩篇 41:7-13'],
        96: [False,
             '申命記 4:15-49, 申命記 5, 路加福音 11:5-32, 箴言 8:32-36'],
        97: [False,
             '申命記 6, 申命記 7, 申命記 8, 路加福音 11:33-54, 詩篇 '
             '42:1-6'],
        98: [False, '申命記 9, 申命記 10, 路加福音 12:1-34, 詩篇 42:7-11'],
        99: [False, '申命記 11, 申命記 12, 路加福音 12:35-59, 詩篇 43:1-5'],
        100: [False, '申命記 13, 申命記 14, 路加福音 13:1-30, 箴言 9:1-12'],
        101: [False,
              '申命記 15, 申命記 16:1-20, 路加福音 13:31-35, 路加福音 14:1-14, '
              '詩篇 44:1-12'],
        102: [False,
              '申命記 16:21-22, 申命記 17, 申命記 18, 路加福音 14:15-35, '
              '詩篇 44:13-26'],
        103: [False, '申命記 19, 申命記 20, 路加福音 15:1-32, 詩篇 45:1-9'],
        104: [False, '申命記 21, 申命記 22, 路加福音 16:1-18, 箴言 9:13-18'],
        105: [False,
              '申命記 23, 申命記 24, 申命記 25:1-19, 路加福音 16:19-31, '
              '路加福音 17:1-10, 詩篇 45:10-17'],
        106: [False,
              '申命記 26, 申命記 27, 申命記 28:1-14, 路加福音 17:11-37, '
              '詩篇 46:1-11'],
        107: [False, '申命記 28:15-68, 路加福音 18:1-30, 詩篇 47:1-9'],
        108: [False,
              '申命記 29, 申命記 30:1-10, 路加福音 18:31-43, 路加福音 19:1-10, '
              '箴言 10:1-10'],
        109: [False,
              '申命記 30:11-20, 申命記 31:1-29, 路加福音 19:11-44, 詩篇 '
              '48:1-8'],
        110: [False,
              '申命記 31:30, 申命記 32, 路加福音 19:45-48, 路加福音 20:1-26, 詩篇 '
              '48:9-14'],
        111: [False,
              '申命記 33, 申命記 34:1-12, 路加福音 20:27-47, 路加福音 21:1-4, 詩篇 '
              '49:1-20'],
        112: [False, '約書亞記 1, 約書亞記 2, 路加福音 21:5-38, 箴言 10:11-20'],
        113: [False, '約書亞記 3, 約書亞記 4, 約書亞記 5:1-12, 路加福音 22:1-38, 詩篇 50:1-15'],
        114: [False,
              '約書亞記 5:13-15, 約書亞記 6, 約書亞記 7, 路加福音 22:39-62, 詩篇 50:16-23'],
        115: [False,
              '約書亞記 8, 約書亞記 9:1-15, 路加福音 22:63-71, 路加福音 23:1-25, 詩篇 51:1-9'],
        116: [False, '約書亞記 9:16-27, 約書亞記 10, 路加福音 23:26-56, 箴言 10:21-30'],
        117: [False, '約書亞記 11, 約書亞記 12, 路加福音 24:1-35, 詩篇 51:10-19'],
        118: [False, '約書亞記 13, 約書亞記 14, 路加福音 24:36-53, 詩篇 52:1-9'],
        119: [False, '約書亞記 15, 約書亞記 16, 約翰福音 1:1-28, 詩篇 53:1-6'],
        120: [False,
              '約書亞記 17, 約書亞記 18, 約翰福音 1:29-51, 箴言 10:31-32, 箴言 '
              '11:1-8'],
        121: [False,
              '約書亞記 19, 約書亞記 20, 約書亞記 21:1-19, 約翰福音 2:1-25, 詩篇 54:1-7'],
        122: [False, '約書亞記 21:20-45, 約書亞記 22, 約翰福音 3:1-21, 詩篇 55:1-11'],
        123: [False, '約書亞記 23, 約書亞記 24, 約翰福音 3:22-36, 詩篇 55:12-23'],
        124: [False, '士師記 1, 士師記 2:1-5, 約翰福音 4:1-26, 箴言 11:9-18'],
        125: [False, '士師記 2:6-23, 士師記 3, 約翰福音 4:27-42, 詩篇 56:1-13'],
        126: [False, '士師記 4, 士師記 5, 約翰福音 4:43-54, 約翰福音 5:1-15, 詩篇 57:1-6'],
        127: [False, '士師記 6, 士師記 7:1-8, 約翰福音 5:16-30, 詩篇 57:7-11'],
        128: [False, '士師記 7:8-25, 士師記 8, 約翰福音 5:31-47, 箴言 11:19-28'],
        129: [False, '士師記 9, 約翰福音 6:1-24, 詩篇 58:1-11'],
        130: [False, '士師記 10, 士師記 11, 約翰福音 6:25-59, 詩篇 59:1-8'],
        131: [False, '士師記 12, 士師記 13, 約翰福音 6:60-71, 約翰福音 7:1-13, 詩篇 59:9-19'],
        132: [False,
              '士師記 14, 士師記 15, 約翰福音 7:14-44, 箴言 11:29-31, 箴言 '
              '12:1-7'],
        133: [False, '士師記 16, 士師記 17, 約翰福音 7:45-53, 約翰福音 8:1-11, 詩篇 60:1-4'],
        134: [False, '士師記 18, 士師記 19, 約翰福音 8:12-30, 詩篇 60:5-12'],
        135: [False, '士師記 20, 士師記 21, 約翰福音 8:31-59, 詩篇 61:1-8'],
        136: [False, '路得記 1, 路得記 2, 約翰福音 9:1-34, 箴言 12:8-17'],
        137: [False, '路得記 3, 路得記 4, 約翰福音 9:35-41, 約翰福音 10:1-21, 詩篇 62:1-12'],
        138: [False, '撒母耳記上 1, 撒母耳記上 2:1-26, 約翰福音 10:22-42, 詩篇 63:1-11'],
        139: [False,
              '撒母耳記上 2:27-36, 撒母耳記上 3, 撒母耳記上 4, 約翰福音 11:1-44, 詩篇 64:1-10'],
        140: [False,
              '撒母耳記上 5, 撒母耳記上 6, 撒母耳記上 7, 約翰福音 11:45-57, 約翰福音 12:1-11, '
              '箴言 12:18-27'],
        141: [False,
              '撒母耳記上 8, 撒母耳記上 9, 撒母耳記上 10:1-8, 約翰福音 12:12-26, 詩篇 65:1-13'],
        142: [False,
              '撒母耳記上 10:9-27, 撒母耳記上 11, 撒母耳記上 12, 約翰福音 12:37-50, 約翰福音 '
              '13:1-17, 詩篇 66:1-12'],
        143: [False, '撒母耳記上 13, 撒母耳記上 14:1-23, 約翰福音 13:18-38, 詩篇 66:13-20'],
        144: [False,
              '撒母耳記上 14:24-52, 撒母耳記上 15, 約翰福音 14:1-31, 箴言 12:28, 箴言 '
              '13:1-9'],
        145: [False,
              '撒母耳記上 16, 撒母耳記上 17:1-37, 約翰福音 15, 約翰福音 16:1-4, 詩篇 67:1-7'],
        146: [False,
              '撒母耳記上 17:38-58, 撒母耳記上 18, 約翰福音 16:5-33, 約翰福音 17:1-5, 詩篇 '
              '68:1-6'],
        147: [False, '撒母耳記上 19, 撒母耳記上 20, 約翰福音 17:6-26, 詩篇 68:7-14'],
        148: [False,
              '撒母耳記上 21, 撒母耳記上 22, 撒母耳記上 23, 約翰福音 18:1-24, 箴言 '
              '13:10-19'],
        149: [False, '撒母耳記上 24, 撒母耳記上 25, 約翰福音 18:25-40, 詩篇 68:15-20'],
        150: [False,
              '撒母耳記上 26, 撒母耳記上 27, 撒母耳記上 28, 約翰福音 19:1-27, 詩篇 68:21-27'],
        151: [False,
              '撒母耳記上 29, 撒母耳記上 30, 撒母耳記上 31, 約翰福音 19:28-42, 約翰福音 20:1-9, '
              '詩篇 68:28-35'],
        152: [False,
              '撒母耳記下 1, 撒母耳記下 2:1-7, 約翰福音 20:10-31, 箴言 13:20-25, 箴言 '
              '14:1-4'],
        153: [False, '撒母耳記下 2:8-32, 撒母耳記下 3:1-21, 約翰福音 21:1-25, 詩篇 69:1-12'],
        154: [False,
              '撒母耳記下 3:22-39, 撒母耳記下 4, 撒母耳記下 5:1-5, 使徒行傳 1:1-22, 詩篇 '
              '69:13-28'],
        155: [False,
              '撒母耳記下 5:6-25, 撒母耳記下 6, 使徒行傳 1:23-26, 使徒行傳 2:1-21, 詩篇 '
              '69:29-36'],
        156: [False, '撒母耳記下 7, 撒母耳記下 8, 使徒行傳 2:22-47, 箴言 14:4-14'],
        157: [False, '撒母耳記下 9, 撒母耳記下 10, 使徒行傳 3, 詩篇 70:1-5'],
        158: [False, '撒母耳記下 11, 撒母耳記下 12, 使徒行傳 4:1-22, 詩篇 71:1-8'],
        159: [False, '撒母耳記下 13, 使徒行傳 4:23-37, 使徒行傳 5:1-11, 詩篇 71:9-18'],
        160: [False, '撒母耳記下 14, 撒母耳記下 15:1-12, 使徒行傳 5:12-42, 箴言 14:15-24'],
        161: [False,
              '撒母耳記下 15:13-37, 撒母耳記下 16:1-14, 使徒行傳 6, 使徒行傳 7:1-19, 詩篇 '
              '71:19-24'],
        162: [False,
              '撒母耳記下 16:15-23, 撒母耳記下 17, 撒母耳記下 18:1-18, 使徒行傳 7:20-43, 詩篇 '
              '72:1-20'],
        163: [False,
              '撒母耳記下 18:19-33, 撒母耳記下 19, 使徒行傳 7:44-60, 使徒行傳 8:1-3, 詩篇 '
              '73:1-14'],
        164: [False, '撒母耳記下 20, 撒母耳記下 21, 使徒行傳 8:4-40, 箴言 14:25-35'],
        165: [False, '撒母耳記下 22, 撒母耳記下 23:1-7, 使徒行傳 9:1-31, 詩篇 73:15-28'],
        166: [False,
              '撒母耳記下 23:8-39, 撒母耳記下 24:1-25, 使徒行傳 9:32-43, 使徒行傳 10:1-23, 詩篇 '
              '74:1-9'],
        167: [False,
              '列王紀上 1, 列王紀上 2:1-12, 使徒行傳 10:23-48, 使徒行傳 11:1-18, 詩篇 '
              '74:10-17'],
        168: [False,
              '列王紀上 2:13-46, 列王紀上 3:1-15, 使徒行傳 11:19-30, 使徒行傳 12:1-19, 箴言 '
              '15:1-10'],
        169: [False,
              '列王紀上 3:16-28, 列王紀上 4, 列王紀上 5, 使徒行傳 12:19-25, 使徒行傳 13:1-12, '
              '詩篇 74:18-23'],
        170: [False, '列王紀上 6, 列王紀上 7:1-22, 使徒行傳 13:13-41, 詩篇 75:1-10'],
        171: [False,
              '列王紀上 7:23-51, 列王紀上 8:1-21, 使徒行傳 13:42-52, 使徒行傳 14:1-7, 詩篇 '
              '76:1-12'],
        172: [False,
              '列王紀上 8:22-66, 列王紀上 9:1-9, 使徒行傳 14:8-28, 箴言 15:11-20'],
        173: [False,
              '列王紀上 9:10-28, 列王紀上 10, 列王紀上 11:1-13, 使徒行傳 15:1-21, 詩篇 '
              '77:1-9'],
        174: [False,
              '列王紀上 11:14-43, 列王紀上 12:1-24, 使徒行傳 15:22-41, 詩篇 77:10-20'],
        175: [False,
              '列王紀上 12:25-33, 列王紀上 13, 列王紀上 14:1-20, 使徒行傳 16:1-15, 詩篇 '
              '78:1-8'],
        176: [False,
              '列王紀上 14:21-31, 列王紀上 15, 列王紀上 16:1-7, 使徒行傳 16:16-40, 箴言 '
              '15:21-30'],
        177: [False,
              '列王紀上 16:8-34, 列王紀上 17, 列王紀上 18:1-15, 使徒行傳 17:1-21, 詩篇 '
              '78:9-16'],
        178: [False,
              '列王紀上 18:16-46, 列王紀上 19, 使徒行傳 17:22-34, 使徒行傳 18:1-8, 詩篇 '
              '78:17-31'],
        179: [False,
              '列王紀上 20, 列王紀上 21, 使徒行傳 18:9-28, 使徒行傳 19:1-13, 詩篇 78:32-39'],
        180: [False,
              '列王紀上 22:1-53, 使徒行傳 19:14-41, 箴言 15:31-33, 箴言 16:1-7'],
        181: [False, '列王紀下 1, 列王紀下 2:1-25, 使徒行傳 20:1-38, 詩篇 78:40-55'],
        182: [False, '列王紀下 3, 列王紀下 4:1-37, 使徒行傳 21:1-26, 詩篇 78:56-72'],
        183: [False,
              '列王紀下 4:38-44, 列王紀下 5, 列王紀下 6:1-23, 使徒行傳 21:27-40, 使徒行傳 '
              '22:1-22, 詩篇 79:1-13'],
        184: [False,
              '列王紀下 6:24-33, 列王紀下 7, 列王紀下 8:1-15, 使徒行傳 22:22-30, 使徒行傳 '
              '23:1-11, 箴言 16:8-17'],
        185: [False, '列王紀下 8:16-29, 列王紀下 9, 使徒行傳 23:12-35, 詩篇 80:1-7'],
        186: [False, '列王紀下 10, 列王紀下 11, 使徒行傳 24:1-27, 詩篇 80:8-19'],
        187: [False,
              '列王紀下 12, 列王紀下 13, 列王紀下 14:1-22, 使徒行傳 25:1-22, 詩篇 81:1-7'],
        188: [False,
              '列王紀下 14:23-29, 列王紀下 15, 使徒行傳 25:23-27, 使徒行傳 26:1-23, 箴言 '
              '16:18-27'],
        189: [False,
              '列王紀下 16, 列王紀下 17, 使徒行傳 26:24-32, 使徒行傳 27:1-12, 詩篇 81:8-16'],
        190: [False, '列王紀下 18, 列王紀下 19:1-13, 使徒行傳 27:13-44, 詩篇 82:1-8'],
        191: [False, '列王紀下 19:14-37, 列王紀下 20, 使徒行傳 28:1-16, 詩篇 83:1-18'],
        192: [False,
              '列王紀下 21, 列王紀下 22, 使徒行傳 28:17-31, 箴言 16:28-33, 箴言 '
              '17:1-4'],
        193: [False, '列王紀下 23, 列王紀下 24:1-7, 羅馬書 1:1-17, 詩篇 84:1-7'],
        194: [False, '列王紀下 24:8-20, 列王紀下 25, 羅馬書 1:18-32, 詩篇 84:8-12'],
        195: [False,
              '約拿書 1, 約拿書 2, 約拿書 3, 約拿書 4, 羅馬書 2:1-16, 詩篇 85:1-7'],
        196: [False, '阿摩司書 1, 阿摩司書 2, 羅馬書 2:17-29, 羅馬書 3:1-8, 箴言 17:5-14'],
        197: [False, '阿摩司書 3, 阿摩司書 4, 羅馬書 3:9-31, 詩篇 85:8-13'],
        198: [False, '阿摩司書 5, 羅馬書 4:1-15, 詩篇 86:1-10'],
        199: [False, '阿摩司書 6, 阿摩司書 7, 羅馬書 4:16-25, 羅馬書 5:1-11, 詩篇 86:11-17'],
        200: [False, '阿摩司書 8, 阿摩司書 9, 羅馬書 5:12-21, 箴言 17:15-24'],
        201: [False, '何西阿書 1, 何西阿書 2, 羅馬書 6:1-14, 詩篇 87:1-7'],
        202: [False,
              '何西阿書 3, 何西阿書 4, 何西阿書 5, 羅馬書 6:15-23, 羅馬書 7:1-6, 詩篇 88:1-9'],
        203: [False, '何西阿書 6, 何西阿書 7, 羅馬書 7:7-25, 詩篇 88:9-18'],
        204: [False,
              '何西阿書 8, 何西阿書 9, 羅馬書 8:1-17, 箴言 17:25-28, 箴言 18:1-6'],
        205: [False, '何西阿書 10, 何西阿書 11, 羅馬書 8:18-39, 詩篇 89:1-8'],
        206: [False,
              '何西阿書 11, 何西阿書 12, 何西阿書 13, 何西阿書 14, 羅馬書 9:1-21, 詩篇 89:9-13'],
        207: [False,
              '歷代志上 1, 歷代志上 2:1-17, 羅馬書 9:22-33, 羅馬書 10:1-4, '
              '詩篇 89:14-18'],
        208: [False,
              '歷代志上 2:18-55, 歷代志上 3, 歷代志上 4:1-8, 羅馬書 '
              '10:5-21, 羅馬書 11:1-10, 箴言 18:7-16'],
        209: [False,
              '歷代志上 4:9-43, 歷代志上 5, 羅馬書 11:11-32, 詩篇 89:19-29'],
        210: [False,
              '歷代志上 6, 羅馬書 11:33-36, 羅馬書 12:1-21, 詩篇 89:30-37'],
        211: [False, '歷代志上 7, 歷代志上 8, 羅馬書 13:1-14, 詩篇 89:38-45'],
        212: [False,
              '歷代志上 9, 歷代志上 10:1-14, 羅馬書 14:1-18, 箴言 '
              '18:17-24, 箴言 19:1-2'],
        213: [False,
              '歷代志上 11, 歷代志上 12:1-22, 羅馬書 14:19-23, 羅馬書 '
              '15:1-13, 詩篇 89:46-52'],
        214: [False,
              '歷代志上 12:23-40, 歷代志上 13, 歷代志上 14, 羅馬書 '
              '15:14-33, 詩篇 90:1-10'],
        215: [False,
              '歷代志上 15, 歷代志上 16:1-36, 羅馬書 16, 詩篇 90:11-17'],
        216: [False,
              '歷代志上 16:37-43, 歷代志上 17, 歷代志上 18, 哥林多前書 '
              '1:1-17, 箴言 19:3-12'],
        217: [False,
              '歷代志上 19, 歷代志上 20, 歷代志上 21, 哥林多前書 '
              '1:18-31, 哥林多前書 2:1-5, 詩篇 91:1-8'],
        218: [False,
              '歷代志上 22, 歷代志上 23, 哥林多前書 2:6-16, 詩篇 91:9-16'],
        219: [False,
              '歷代志上 24, 歷代志上 25, 歷代志上 26:1-19, 哥林多前書 '
              '3, 詩篇 92:1-15'],
        220: [False,
              '歷代志上 26:20-32, 歷代志上 27, 哥林多前書 4, 箴言 '
              '19:13-22'],
        221: [False,
              '歷代志上 28, 歷代志上 29, 哥林多前書 5, 詩篇 93:1-5'],
        222: [False, '歷代志下 1:1-17, 哥林多前書 6, 詩篇 94:1-11'],
        223: [False,
              '傳道書 1, 傳道書 2, 傳道書 3:1-22, 哥林多前書 '
              '7:1-16, 詩篇 94:12-23'],
        224: [False,
              '傳道書 4, 傳道書 5, 傳道書 6, 哥林多前書 7:17-35, '
              '箴言 19:23-29, 箴言 20:1-4'],
        225: [False,
              '傳道書 7, 傳道書 8, 傳道書 9:1-12, 哥林多前書 '
              '7:36-40, 哥林多前書 8:1-13, 詩篇 95:1-11'],
        226: [False,
              '傳道書 9:13-18, 傳道書 10, 傳道書 11, 傳道書 '
              '12, 哥林多前書 9:1-18, 詩篇 96:1-13'],
        227: [False,
              '歷代志下 2, 歷代志下 3, 歷代志下 4, 歷代志下 5:1, 哥林多前書 9:19-27, 哥林多前書 10:1-13, 詩篇 97:1-12'],
        228: [False,
              '歷代志下 5:2-14, 歷代志下 6, 歷代志下 7:1-10, 哥林多前書 10:14-33, 哥林多前書 11:1, 箴言 20:5-14'],
        229: [False,
              '歷代志下 7:11-22, 歷代志下 8, 歷代志下 9, 哥林多前書 '
              '11:2-34, 詩篇 98:1-9'],
        230: [False,
              '雅歌 1, 雅歌 2, 雅歌 3, 雅歌 4, 哥林多前書 12:1-26, 詩篇 99:1-9'],
        231: [False,
              '雅歌 5, 雅歌 6, 雅歌 7, 雅歌 8, 哥林多前書 12:27-31, 哥林多前書 '
              '13:1-13, 詩篇 100:1-5'],
        232: [False,
              '歷代志下 10, 歷代志下 11, 歷代志下 12, 哥林多前書 '
              '14:1-19, 箴言 20:15-24'],
        233: [False,
              '歷代志下 13, 歷代志下 14, 歷代志下 15, 哥林多前書 '
              '14:20-40, 詩篇 101:1-8'],
        234: [False,
              '歷代志下 16, 歷代志下 17, 歷代志下 18:1-27, 哥林多前書 '
              '15:1-34, 詩篇 102:1-11'],
        235: [False,
              '歷代志下 18:28-34, 歷代志下 19, 歷代志下 20, 哥林多前書 '
              '15:35-49, 詩篇 102:12-17'],
        236: [False,
              '歷代志下 21, 歷代志下 22, 歷代志下 23, 哥林多前書 '
              '15:50-58, 哥林多前書 16:1-4, 箴言 20:25-30, 箴言 21:1-4'],
        237: [False,
              '歷代志下 24, 歷代志下 25, 哥林多前書 16:5-24, 詩篇 '
              '102:18-28'],
        238: [False,
              '歷代志下 26, 歷代志下 27, 歷代志下 28, 哥林多後書 '
              '1:1-11, 詩篇 103:1-12'],
        239: [False,
              '歷代志下 29, 歷代志下 30, 歷代志下 31:1, 哥林多後書 '
              '1:12-22, 詩篇 103:13-22'],
        240: [False,
              '歷代志下 31:2-21, 歷代志下 32, 歷代志下 33:1-20, 哥林多後書 1:23, 哥林多後書 2:1-11, 箴言 21:5-16'],
        241: [False,
              '歷代志下 33:21-24, 歷代志下 34, 歷代志下 35:1-19, 哥林多後書 2:12-17, 哥林多後書 3:1-6, 詩篇 104:1-18'],
        242: [False,
              '歷代志下 35:20-27, 歷代志下 36, 哥林多後書 3:7-18, 詩篇 '
              '104:19-30'],
        243: [False,
              '彌迦書 1, 彌迦書 2, 彌迦書 3, 彌迦書 4, 哥林多後書 4, 詩篇 104:31-35'],
        244: [False,
              '彌迦書 5, 彌迦書 6, 彌迦書 7, 哥林多後書 5:1-10, 箴言 21:17-26'],
        245: [False,
              '以賽亞書 1, 以賽亞書 2, 哥林多後書 5:11-21, 哥林多後書 6:1-2, 詩篇 '
              '105:1-11'],
        246: [False,
              '以賽亞書 3, 以賽亞書 4, 以賽亞書 5:1-7, 哥林多後書 6:3-18, 哥林多後書 '
              '7:1, 詩篇 105:12-22'],
        247: [False,
              '以賽亞書 5:8-30, 以賽亞書 6, 以賽亞書 7, 以賽亞書 8:1-10, 哥林多後書 '
              '7:2-16, 詩篇 105:23-36'],
        248: [False,
              '以賽亞書 8:11-22, 以賽亞書 9, 以賽亞書 10:1-19, 哥林多後書 8:1-15, '
              '箴言 21:27-31, 箴言 22:1-6'],
        249: [False,
              '以賽亞書 10:20-34, 以賽亞書 11, 以賽亞書 12, 以賽亞書 13, 哥林多後書 '
              '8:16-24, 哥林多後書 9:1-5, 詩篇 105:37-45'],
        250: [False,
              '以賽亞書 14, 以賽亞書 15, 以賽亞書 16, 哥林多後書 9:6-15, 詩篇 106:1-15'],
        251: [False,
              '以賽亞書 17, 以賽亞書 18, 以賽亞書 19, 哥林多後書 10, 詩篇 106:16-31'],
        252: [False,
              '以賽亞書 20, 以賽亞書 21, 以賽亞書 22, 以賽亞書 23, 哥林多後書 11:1-15, '
              '箴言 22:7-16'],
        253: [False,
              '以賽亞書 24, 以賽亞書 25, 以賽亞書 26, 哥林多後書 11:16-33, 詩篇 '
              '106:32-39'],
        254: [False, '以賽亞書 27, 以賽亞書 28, 哥林多後書 12:1-10, 詩篇 106:40-48'],
        255: [False,
              '以賽亞書 29, 以賽亞書 30:1-18, 哥林多後書 12:11-21, 詩篇 107:1-9'],
        256: [False,
              '以賽亞書 30:19-33, 以賽亞書 31, 以賽亞書 32, 哥林多後書 13, 箴言 '
              '22:17-27'],
        257: [False, '以賽亞書 33, 以賽亞書 34, 以賽亞書 35, 加拉太書 1, 詩篇 107:10-22'],
        258: [False, '以賽亞書 36, 以賽亞書 37, 加拉太書 2:1-10, 詩篇 107:23-32'],
        259: [False,
              '以賽亞書 38, 以賽亞書 39, 以賽亞書 40, 加拉太書 2:11-21, 加拉太書 3:1-9, '
              '詩篇 107:33-43'],
        260: [False,
              '以賽亞書 41, 以賽亞書 42, 加拉太書 3:10-25, 箴言 22:28-29, 箴言 '
              '23:1-9'],
        261: [False,
              '以賽亞書 43, 以賽亞書 44:1-23, 加拉太書 3:26-29, 加拉太書 4:1-20, 詩篇 '
              '108:1-5'],
        262: [False,
              '以賽亞書 44:24-28, 以賽亞書 45, 以賽亞書 46, 加拉太書 4:21-31, 加拉太書 '
              '5:1-6, 詩篇 108:6-13'],
        263: [False,
              '以賽亞書 47, 以賽亞書 48, 以賽亞書 49:1-7, 加拉太書 5:7-26, 詩篇 109:1-20'],
        264: [False,
              '以賽亞書 49:8-26, 以賽亞書 50, 以賽亞書 51:1-16, 加拉太書 6, 箴言 '
              '23:10-18'],
        265: [False,
              '以賽亞書 51:17-23, 以賽亞書 52, 以賽亞書 53, 以賽亞書 54, 以弗所書 1, 詩篇 '
              '109:21-31'],
        266: [False,
              '以賽亞書 55, 以賽亞書 56, 以賽亞書 57:1-13, 以弗所書 2, 詩篇 110:1-7'],
        267: [False,
              '以賽亞書 57:14-21, 以賽亞書 58, 以賽亞書 59, 以弗所書 3, 詩篇 111:1-10'],
        268: [False,
              '以賽亞書 60, 以賽亞書 61, 以賽亞書 62, 以弗所書 4:1-16, 箴言 23:19-28'],
        269: [False,
              '以賽亞書 63, 以賽亞書 64, 以賽亞書 65:1-16, 以弗所書 4:17-32, 以弗所書 '
              '5:1-7, 詩篇 112:1-10'],
        270: [False, '以賽亞書 65:17-25, 以賽亞書 66, 以弗所書 5:8-33, 詩篇 113:1-9'],
        271: [False, '那鴻書 1, 那鴻書 2, 那鴻書 3, 以弗所書 6, 詩篇 114:1-8'],
        272: [False,
              '西番雅書 1, 西番雅書 2, 西番雅書 3, 腓立比書 1:1-26, 箴言 '
              '23:29-35, 箴言 24:1-4'],
        273: [False,
              '耶利米書 1, 耶利米書 2:1-30, 腓立比書 1:27-30, 腓立比書 2:1-11, '
              '詩篇 115:1-11'],
        274: [False,
              '耶利米書 2:31-47, 耶利米書 3, 耶利米書 4:1-9, 腓立比書 2:12-30, '
              '詩篇 115:12-18'],
        275: [False,
              '耶利米書 4:10-31, 耶利米書 5, 腓立比書 3, 腓立比書 4:1, 詩篇 '
              '116:1-11'],
        276: [False,
              '耶利米書 6, 耶利米書 7:1-29, 腓立比書 4:2-23, 箴言 24:5-14'],
        277: [False,
              '耶利米書 7:30-34, 耶利米書 8, 耶利米書 9:1-16, 歌羅西書 1:1-23, '
              '詩篇 116:12-19'],
        278: [False,
              '耶利米書 9:17-26, 耶利米書 10, 耶利米書 11:1-17, 歌羅西書 1:24-29, '
              '歌羅西書 2:1-5, 詩篇 117:1-2'],
        279: [False,
              '耶利米書 11:18-23, 耶利米書 12, 耶利米書 13, 歌羅西書 2:6-23, 詩篇 '
              '118:1-16'],
        280: [False,
              '耶利米書 14, 耶利米書 15, 歌羅西書 3, 歌羅西書 4:1, 箴言 '
              '24:15-22'],
        281: [False, '耶利米書 16, 耶利米書 17, 歌羅西書 4:2-18, 詩篇 118:17-29'],
        282: [False,
              '耶利米書 18, 耶利米書 19, 耶利米書 20, 帖撒羅尼迦前書 1, 帖撒羅尼迦前書 2:1-16, 詩篇 119:1-8'],
        283: [False,
              '耶利米書 21, 耶利米書 22, 耶利米書 23:1-8, 帖撒羅尼迦前書 2:17-19, 帖撒羅尼迦前書 3, 詩篇 119:9-16'],
        284: [False,
              '耶利米書 23:9-40, 耶利米書 24, 耶利米書 25:1-14, 帖撒羅尼迦前書 4, '
              '箴言 24:23-34'],
        285: [False,
              '耶利米書 25:15-38, 耶利米書 26, 帖撒羅尼迦前書 5, 詩篇 119:17-24'],
        286: [False,
              '耶利米書 27, 耶利米書 28, 耶利米書 29:1-23, 帖撒羅尼迦後書 1, 詩篇 '
              '119:25-32'],
        287: [False,
              '耶利米書 29:24-32, 耶利米書 30, 耶利米書 31:1-14, 帖撒羅尼迦後書 2, '
              '詩篇 119:33-40'],
        288: [False,
              '耶利米書 31:15-40, 耶利米書 32:1-25, 帖撒羅尼迦後書 3, 箴言 '
              '25:1-10'],
        289: [False,
              '耶利米書 32:26-44, 耶利米書 33, 耶利米書 34, 提摩太前書 1, 詩篇 '
              '119:41-48'],
        290: [False,
              '耶利米書 35, 耶利米書 36, 耶利米書 37, 提摩太前書 2, 詩篇 119:49-56'],
        291: [False,
              '耶利米書 38, 耶利米書 39, 耶利米書 40:1-6, 提摩太前書 3, 詩篇 '
              '119:57-64'],
        292: [False,
              '耶利米書 40:7-16, 耶利米書 41, 耶利米書 42, 提摩太前書 4, 箴言 '
              '25:11-20'],
        293: [False,
              '耶利米書 43, 耶利米書 44, 耶利米書 45, 提摩太前書 5, 提摩太前書 6:1-2, '
              '詩篇 119:65-72'],
        294: [False, '耶利米書 46, 耶利米書 47, 提摩太前書 6:3-21, 詩篇 119:73-80'],
        295: [False, '耶利米書 48, 耶利米書 49:1-6, 提摩太後書 1, 詩篇 119:81-88'],
        296: [False,
              '耶利米書 49:7-39, 耶利米書 50:1-10, 提摩太後書 2, 箴言 25:21-28, '
              '箴言 26:1-2'],
        297: [False,
              '耶利米書 50:11-46, 耶利米書 51:1-14, 提摩太後書 3, 詩篇 119:89-96'],
        298: [False, '耶利米書 51:15-64, 提摩太後書 4, 詩篇 119:97-104'],
        299: [False, '耶利米書 52, 提多書 1, 詩篇 119:105-112'],
        300: [False,
              '哈巴谷書 1, 哈巴谷書 2, 哈巴谷書 3:1-19, 提多書 2, 箴言 26:3-12'],
        301: [False, '耶利米哀歌 1, 耶利米哀歌 2:1-6, 提多書 3, 詩篇 119:113-120'],
        302: [False,
              '耶利米哀歌 2:7-27, 耶利米哀歌 3:1-39, 腓利門書 1, 詩篇 '
              '119:121-128'],
        303: [False,
              '耶利米哀歌 3:40-66, 耶利米哀歌 4, 耶利米哀歌 5, 希伯來書 1, 詩篇 '
              '119:129-136'],
        304: [False, '俄巴底亞書 1, 希伯來書 2, 箴言 26:13-22'],
        305: [False, '約珥書 1, 約珥書 2:1-17, 希伯來書 3, 詩篇 119:137-144'],
        306: [False, '約珥書 2:18-32, 約珥書 3, 希伯來書 4:1-13, 詩篇 119:145-152'],
        307: [False,
              '以西結書 1, 以西結書 2, 以西結書 3, 希伯來書 4:14-16, 希伯來書 5:1-10, '
              '詩篇 119:153-160'],
        308: [False,
              '以西結書 4, 以西結書 5, 以西結書 6, 希伯來書 5:11-14, 希伯來書 6:1-12, '
              '箴言 26:23-28, 箴言 27:1-4'],
        309: [False,
              '以西結書 7, 以西結書 8, 以西結書 9, 希伯來書 6:13-20, 希伯來書 7:1-10, '
              '詩篇 119:161-168'],
        310: [False,
              '以西結書 10, 以西結書 11, 以西結書 12, 希伯來書 7:11-28, 詩篇 '
              '119:169-176'],
        311: [False, '以西結書 13, 以西結書 14, 以西結書 15, 希伯來書 8, 詩篇 120:1-7'],
        312: [False, '以西結書 16, 希伯來書 9:1-15, 箴言 27:5-14'],
        313: [False, '以西結書 17, 以西結書 18, 希伯來書 9:16-28, 詩篇 121:1-8'],
        314: [False, '以西結書 19, 以西結書 20:1-44, 希伯來書 10:1-18, 詩篇 122:1-9'],
        315: [False,
              '以西結書 20:45-49, 以西結書 21, 以西結書 22:1-22, 希伯來書 10:19-39, 詩篇 '
              '123:1-4'],
        316: [False,
              '以西結書 22:23-31, 以西結書 23, 希伯來書 11:1-16, 箴言 27:15-22'],
        317: [False, '以西結書 24, 以西結書 25, 希伯來書 11:17-40, 詩篇 124:1-8'],
        318: [False, '以西結書 26, 以西結書 27, 希伯來書 12:1-13, 詩篇 125:1-5'],
        319: [False, '以西結書 28, 以西結書 29, 希伯來書 12:14-29, 詩篇 126:1-6'],
        320: [False,
              '以西結書 30, 以西結書 31, 希伯來書 13, 箴言 27:23-27, 箴言 '
              '28:1-6'],
        321: [False, '以西結書 32, 以西結書 33:1-32, 雅各書 1, 詩篇 127:1-5'],
        322: [False,
              '以西結書 33:21-33, 以西結書 34, 以西結書 35, 雅各書 2, 詩篇 128:1-6'],
        323: [False, '以西結書 36, 以西結書 37, 雅各書 3, 詩篇 129:1-8'],
        324: [False, '以西結書 38, 以西結書 39, 雅各書 4, 箴言 28:7-17'],
        325: [False, '以西結書 40, 雅各書 5, 詩篇 130:1-8'],
        326: [False,
              '以西結書 41, 以西結書 42, 彼得前書 1, 彼得前書 2:1-3, 詩篇 131:1-3'],
        327: [False, '以西結書 43, 以西結書 44, 彼得前書 2:4-25, 詩篇 132:1-18'],
        328: [False, '以西結書 45, 以西結書 46, 彼得前書 3, 箴言 28:18-28'],
        329: [False, '以西結書 47, 以西結書 48, 彼得前書 4, 詩篇 133:1-3'],
        330: [False, '但以理書 1, 但以理書 2:1-23, 彼得前書 5, 詩篇 134:1-3'],
        331: [False, '但以理書 2:24-49, 但以理書 3:1-12, 彼得後書 1, 詩篇 135:1-12'],
        332: [False, '但以理書 3:13-30, 但以理書 4:1-18, 彼得後書 2, 箴言 29:1-9'],
        333: [False, '但以理書 4:19-37, 但以理書 5:1-16, 彼得後書 3, 詩篇 135:13-21'],
        334: [False,
              '但以理書 5:17-31, 但以理書 6:1-28, 約翰一書 1, 約翰一書 2, 詩篇 136:1-12'],
        335: [False, '但以理書 7, 但以理書 8:1-14, 約翰一書 2:12-27, 詩篇 136:13-26'],
        336: [False,
              '但以理書 8:15-27, 但以理書 9:1-19, 約翰一書 2:28-29, 約翰一書 3:1-10, 箴言 '
              '29:10-18'],
        337: [False,
              '但以理書 9:20-27, 但以理書 10, 但以理書 11:1, 約翰一書 3:11-24, 約翰一書 4:1-6, '
              '詩篇 137:1-9'],
        338: [False, '但以理書 11:2-35, 約翰一書 4:7-21, 詩篇 138:1-8'],
        339: [False, '但以理書 11:36-45, 但以理書 12, 約翰一書 5:1-21, 詩篇 139:1-10'],
        340: [False, '哈該書 1, 哈該書 2:1-23, 約翰二書 1:1-13, 箴言 29:19-27'],
        341: [False,
              '撒迦利亞書 1, 撒迦利亞書 2, 撒迦利亞書 3, 撒迦利亞書 4, 約翰三書 1:1-14, '
              '詩篇 139:11-16'],
        342: [False,
              '撒迦利亞書 5, 撒迦利亞書 6, 撒迦利亞書 7, 撒迦利亞書 8, 猶大書 1:1-25, 詩篇 '
              '139:17-24'],
        343: [False,
              '撒迦利亞書 9, 撒迦利亞書 10, 撒迦利亞書 11, 啟示錄 1, 詩篇 140:1-5'],
        344: [False,
              '撒迦利亞書 12, 撒迦利亞書 13, 撒迦利亞書 14, 啟示錄 2:1-17, 箴言 '
              '30:1-10'],
        345: [False,
              '以斯帖記 1, 以斯帖記 2:1-18, 啟示錄 2:18-29, 啟示錄 3:1-6, 詩篇 '
              '140:6-13'],
        346: [False,
              '以斯帖記 2:19-23, 以斯帖記 3, 以斯帖記 4, 以斯帖記 5, 啟示錄 3:7-22, 詩篇 '
              '141:1-10'],
        347: [False, '以斯帖記 6, 以斯帖記 7, 以斯帖記 8, 啟示錄 4, 詩篇 142:1-11'],
        348: [False, '以斯帖記 9, 以斯帖記 10, 啟示錄 5, 箴言 30:11-23'],
        349: [False, '瑪拉基書 1, 瑪拉基書 2:1-16, 啟示錄 6, 詩篇 143:1-12'],
        350: [False,
              '瑪拉基書 2:17, 瑪拉基書 3, 瑪拉基書 4, 啟示錄 7, 詩篇 144:1-8'],
        351: [False,
              '以斯拉記 1, 以斯拉記 2:1-67, 啟示錄 8, 啟示錄 9:1-12, 詩篇 144:9-15'],
        352: [False,
              '以斯拉記 2:68-70, 以斯拉記 3, 以斯拉記 4:1-5, 啟示錄 9:13-21, 啟示錄 10, '
              '箴言 30:24-33'],
        353: [False, '以斯拉記 4:6-24, 以斯拉記 5, 啟示錄 11, 詩篇 145:1-7'],
        354: [False,
              '以斯拉記 6, 以斯拉記 7:1-10, 啟示錄 12, 啟示錄 13:1, 詩篇 145:8-13'],
        355: [False, '以斯拉記 7:11-28, 以斯拉記 8:1-14, 啟示錄 13:1-18, 詩篇 145:13-21'],
        356: [False, '以斯拉記 8:15-36, 以斯拉記 9:1-15, 啟示錄 14:1-13, 箴言 31:1-9'],
        357: [False, '以斯拉記 10, 啟示錄 14:14-20, 啟示錄 15, 詩篇 146:1-10'],
        358: [False, '尼希米記 1, 尼希米記 2, 啟示錄 16, 詩篇 147:1-11'],
        359: [False, '尼希米記 3, 尼希米記 4, 啟示錄 17, 詩篇 147:12-20'],
        360: [False,
              '尼希米記 5, 尼希米記 6, 尼希米記 7:1-3, 啟示錄 18:1-17, 箴言 '
              '31:10-20'],
        361: [False,
              '尼希米記 7:4-73, 尼希米記 8, 啟示錄 18:17-24, 啟示錄 19:1-10, '
              '詩篇 148:1-6'],
        362: [False, '尼希米記 9:1-37, 啟示錄 19:11-21, 詩篇 148:7-14'],
        363: [False,
              '尼希米記 9:38, 尼希米記 10, 尼希米記 11:1-21, 啟示錄 20, 詩篇 '
              '149:1-9'],
        364: [False,
              '尼希米記 11:22-36, 尼希米記 12:1-47, 啟示錄 21, 箴言 31:21-31'],
        365: [False, '尼希米記 13, 啟示錄 22, 詩篇 150:1-6'],
    }

    translation = (
        "聖經閱讀計劃",
        "今天是 ",
        "搜索：",
        "聖經視窗頁籤中開啓",
        "隱藏已經閱讀的經文",
        "顯示已經閱讀的經文",
        "重新設置",
        "儲存閱讀進度",
        "第",
        "天",
        "您的閱讀進度儲存在下面這個檔案：",
        "沒法把您的閱讀進度儲存在您現在使用的電腦上！",
    )

    def __init__(self, parent):
        super().__init__()
        self.parent = parent
        # set title
        self.setWindowTitle(self.translation[0])
        self.setMinimumSize(830, 500)
        # set variables
        self.setupVariables()
        # setup interface
        self.setupUI()

    def setupVariables(self):
        import copy, os
        from datetime import date
        self.today = date.today()
        self.todayNo = int(format(self.today, '%j'))
        if self.todayNo > 365:
            self.todayNo = 365
        self.progressFile = os.path.join(os.getcwd(), "plugins", "menu", "{0}.txt".format(self.translation[0]))
        if os.path.isfile(self.progressFile):
            from ast import literal_eval
            with open(self.progressFile, "r") as fileObj:
                self.plan = literal_eval(fileObj.read())
        else:
            self.plan = copy.deepcopy(self.template)
        self.hideCheckedItems = False

    def setupUI(self):
        from qtpy.QtGui import QStandardItemModel
        from qtpy.QtWidgets import (QPushButton, QLabel, QListView, QAbstractItemView, QHBoxLayout, QVBoxLayout, QLineEdit)

        mainLayout = QVBoxLayout()

        readingListLayout = QVBoxLayout()

        readingListLayout.addWidget(QLabel(self.translation[0]))
        readingListLayout.addWidget(QLabel("{0}{1}".format(self.translation[1], self.today)))

        filterLayout = QHBoxLayout()
        filterLayout.addWidget(QLabel(self.translation[2]))
        self.filterEntry = QLineEdit()
        self.filterEntry.textChanged.connect(self.resetItems)
        filterLayout.addWidget(self.filterEntry)
        readingListLayout.addLayout(filterLayout)

        self.readingList = QListView()
        self.readingList.setEditTriggers(QAbstractItemView.NoEditTriggers)
        self.readingListModel = QStandardItemModel(self.readingList)
        self.readingList.setModel(self.readingListModel)
        self.resetItems()
        self.readingListModel.itemChanged.connect(self.itemChanged)
        #print(self.readingList.currentIndex().row())
        #self.readingList.selectionModel().selectionChanged.connect(self.function)
        readingListLayout.addWidget(self.readingList)

        buttonsLayout = QHBoxLayout()

        button = QPushButton(self.translation[3])
        button.clicked.connect(self.openInTabs)
        buttonsLayout.addWidget(button)

        self.hideShowButton = QPushButton(self.translation[4])
        self.hideShowButton.clicked.connect(self.hideShowCheckedItems)
        buttonsLayout.addWidget(self.hideShowButton)

        button = QPushButton(self.translation[6])
        button.clicked.connect(self.resetAllItems)
        buttonsLayout.addWidget(button)

        button = QPushButton(self.translation[7])
        button.clicked.connect(self.saveProgress)
        buttonsLayout.addWidget(button)

        mainLayout.addLayout(readingListLayout)
        mainLayout.addLayout(buttonsLayout)

        self.setLayout(mainLayout)

    def itemChanged(self, standardItem):
        from qtpy.QtCore import Qt
        key = int(standardItem.text().split(".")[0])
        if standardItem.checkState() is Qt.CheckState.Checked:
            self.plan[key][0] = True
        elif standardItem.checkState() is Qt.CheckState.Unchecked:
            self.plan[key][0] = False
        if self.hideCheckedItems:
            self.resetItems()

    def resetItems(self):
        from qtpy.QtGui import QStandardItem
        from qtpy.QtCore import Qt
        # Empty the model before reset
        self.readingListModel.clear()
        # Reset
        index = 0
        todayIndex = None
        filterEntry = self.filterEntry.text()
        for key, value in self.plan.items():
            checked, passages = value
            if not (self.hideCheckedItems and checked) and (filterEntry == "" or (filterEntry != "" and filterEntry.lower() in passages.lower())):
                item = QStandardItem("{0}. {1}".format(key, passages))
                item.setToolTip("{0}{1}{2}".format(self.translation[8], key, self.translation[9]))
                if key == self.todayNo:
                    todayIndex = index
                item.setCheckable(True)
                item.setCheckState(Qt.CheckState.Checked if checked else Qt.CheckState.Unchecked)
                self.readingListModel.appendRow(item)
                index += 1
        if todayIndex is not None:
            self.readingList.setCurrentIndex(self.readingListModel.index(todayIndex, 0))

    def hideShowCheckedItems(self):
        self.hideCheckedItems = not self.hideCheckedItems
        self.resetItems()
        self.hideShowButton.setText(self.translation[5] if self.hideCheckedItems else self.translation[4])

    def resetAllItems(self):
        import copy
        self.plan = copy.deepcopy(self.template)
        self.resetItems()

    def translateIntoChinese(self):
        import copy, pprint
        from BibleBooks import BibleBooks
        plan = copy.deepcopy(self.template)
        filePath = "{0}_zh".format(self.progressFile)
        with open(filePath, "w", encoding="utf-8") as fileObj:
            fileObj.write(pprint.pformat(plan))
        with open(filePath, "r") as fileObj:
            text = fileObj.read()
        translateDict = {}
        bookNames = []
        for key, value in BibleBooks.eng.items():
            bookName = value[-1]
            bookNames.append(bookName)
            translateDict[bookName] = BibleBooks.sc[key][-1]
        bookNames = sorted(bookNames, key=len, reverse=True)
        #print(bookNames)
        for name in bookNames:
            text = text.replace(name, translateDict[name])
        text = text.replace("Psalm", "诗篇")
        with open(filePath, "w", encoding="utf-8") as fileObj:
            fileObj.write(text)

    def saveProgress(self):
        import pprint
        from qtpy.QtWidgets import QMessageBox
        try:
            with open(self.progressFile, "w", encoding="utf-8") as fileObj:
                fileObj.write(pprint.pformat(self.plan))
            message = "{0}\n'{1}'".format(self.translation[10], self.progressFile)
        except:
            message = self.translation[11]
        QMessageBox.information(self, self.translation[0], message)

    def openInTabs(self):
        dayNo = self.readingList.currentIndex().row() + 1
        todayReading = self.plan[dayNo][-1].split(", ")
        openBibleWindowContentOnNextTab = config.openBibleWindowContentOnNextTab
        config.openBibleWindowContentOnNextTab = True
        for reading in todayReading:
            command = "MAIN:::{0}".format(reading)
            self.parent.runTextCommand(command)
        config.openBibleWindowContentOnNextTab = openBibleWindowContentOnNextTab
        self.close()

config.mainWindow.bibleReadingPlan = BibleReadingPlan(config.mainWindow)
config.mainWindow.bibleReadingPlan.show()
